{
  "news": [
    {
      "id": "371209ce-c72e-4ca1-bf4c-39dbda39c943",
      "title": "Google announces Pixel 10a with completely flat camera, pre-order Feb 18",
      "summary": "Get ready, Pixel fans! Google has unleashed details about the highly anticipated Pixel 10a. This mid-range marvel is set to redefine bold design with a groundbreaking, completely flat camera system, finally eliminating that pesky bump! Leaks hint at stunning new colorways, including a vibrant \"Berry\" that looks absolutely delicious. Enthusiasts are eagerly dissecting what two years of innovation will bring compared to the Pixel 8a, expecting major upgrades in performance and Google's signature AI smarts. The buzz is real: the 10a promises a sleek aesthetic paired with excellent value. Mark your calendars – pre-orders for this exciting smartphone kick off on February 18th!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE16c3B3clRLQWZtMEhpZHAzZ3BoZ2JNeHJBcldzSzRob2gwSjR1MTc3OHMwaGRGSmlwSXZBOTMyY2tZQWN6OUNoVGFINktLOHJFV1NDSzFMcHl0WEg5aVFmdW1Zb09zcUtr?oc=5",
      "source_name": "9to5Google",
      "date": "2026-02-04T17:10:00Z"
    },
    {
      "id": "f1ac13ef-f2b8-4fe4-9912-d5fbe3bce31b",
      "title": "We Tested 35 Phones for the Best Battery Life. These 2 Brands Topped the Field",
      "summary": "Tech enthusiasts, prepare for a revelation! A massive test pitted 35 leading smartphones against each other in an epic quest for ultimate battery life. The results are in, and two powerhouse brands have definitively topped the field, proving their incredible stamina under rigorous conditions. Forget constant charging anxiety; these devices promise to keep you powered through your busiest days and wildest adventures. While specific models impress, the overall brand performance indicates serious engineering prowess in power efficiency. This isn't just about big batteries; it's about optimized hardware and software delivering truly impressive endurance. Discover which titans now reign supreme in the longevity arena!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ER0Q4QURsWjdyVGt1NE5CeklJUngxMDVOTmNHd0h2TVRwSHhJVW1zNGFLQl9fS1ZNRVhNZU05aWdFVnpzVndvNWNKYkx2cTc1Ry1QQldWT2pZd3RlOEo3R3ZrNmtPR0ZpQmlPaVN4OWdDb1JlM2JaaXBkUEY?oc=5",
      "source_name": "CNET",
      "date": "2026-02-04T13:01:00Z"
    },
    {
      "id": "f1a2f284-47be-4b07-8b3a-8e58e0cee908",
      "title": "AMD suggests the next-gen Xbox will arrive in 2027",
      "summary": "Hold onto your controllers, gamers! AMD has dropped a bombshell, hinting the next-generation Xbox console could arrive in 2027. This isn't just a rumor; AMD's own slides reportedly reveal that work on the powerful System-on-a-Chip for a 2027 Xbox launch is progressing well. It’s likely to feature their cutting-edge RDNA 5 graphics architecture. This means we're looking at a console poised to deliver groundbreaking visual fidelity and raw performance, pushing gaming's boundaries. Prepare for an epic leap in power, potentially redefining the home console experience. The future of gaming looks incredibly bright and closer than you think!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMipAFBVV95cUxORXN1OGxGU0tFN21yZjVpbUVTVDVETm84UzF2VzF3SWJLc1hUalc1d09mM0lyMHFsVU1OUlgzU2hIWDFwY1ZScDc3Mm9MZWI0Y1B6a0JyMmF6Q2w2MTd0bGlKN3l0clpFY2lZWmk4YTQwdWlQNEdqaVBLb3hNVjBqRWwyOENpRExtYVh6bjJUMzl0MWI5aXBYb3AwOVhkTW10UG04eA?oc=5",
      "source_name": "Engadget",
      "date": "2026-02-04T05:27:00Z"
    },
    {
      "id": "9af46956-f4c3-4eef-a6e7-1623589c1580",
      "title": "M5 Pro and M5 Max MacBook Pro Launch Imminent as Reseller Stock Dwindles",
      "summary": "Tech enthusiasts, brace yourselves! The rumor mill is churning, and all signs point to an imminent launch of Apple's next-generation MacBook Pro, featuring the formidable M5 Pro and M5 Max chips! Reseller stock of current models is plummeting, a near-certain indicator Apple is gearing up to unveil its latest powerhouse machines. We're talking about a significant leap in performance, promising unparalleled speed and efficiency for everything from video editing to complex coding. While some reports hint at a March debut, the excitement is palpable. Prepare for a revolution in portable computing – these new MacBook Pros are set to redefine what's possible, delivering a truly exhilarating upgrade experience.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMieEFVX3lxTE83MUNYX3g3SjhFUEVGanJneVBXRFY3UVVuZGR4Z3lFaUxvVXRDTlJHYVJ5SnBqUElpQi11X1N1SDI5NUI2UTd1QVRZbHdJSGp0c3hSVTRnaHFza21pRmstaWljRGcwams5dFF6d3hFUlJHS1NhYVlSRA?oc=5",
      "source_name": "MacRumors",
      "date": "2026-02-03T20:12:07Z"
    },
    {
      "id": "bcbdcf28-bad5-48ed-9a50-462c0b5cf9a6",
      "title": "iOS 26.2.1 Problems Reported by iPhone Users After the Update",
      "summary": "iPhone users, brace yourselves! The latest iOS 26.2.1 update, intended to deliver critical fixes, is causing a stir with widespread reports of unexpected headaches. Many are experiencing baffling battery drain, persistent app crashes, and frustrating performance glitches that weren't present before. It seems Apple’s latest patch might have introduced its own set of bugs, leaving some devices feeling less \"pro\" and more problematic. While some users report smooth sailing, others are left wondering if this surprise update was truly worth the trouble. Keep an eye out for potential follow-up fixes, and remember, sometimes the bleeding edge cuts both ways! Your feedback is vital, so make your voices heard!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQMXA0TVdjUVgtbVV5TTVVcTkxOUNNd0VGVWVUelp3aDZhNVlDSDg5MkNOdkttSVJ1bnB2RmxiN0xZY1hVTkNiQWtqc0ZyQXQ1NmtKRzZHXzRrVndIYS0zX2Nzd1hiWVFPWDBhb2ZVVkZFRGZqUnl6XzF1bnRDWm5xeGswU2dFNGdHc0NMZVlRMktTMmduODlpU3l0OA?oc=5",
      "source_name": "The Mac Observer",
      "date": "2026-02-04T01:10:34Z"
    },
    {
      "id": "6c8cd59c-a5ea-4bb8-871e-d5eb0e22ec14",
      "title": "Apple's Studio Display 2 Reportedly on Track to Launch This Year With These New Features",
      "summary": "Tech enthusiasts, rejoice! Apple's Studio Display 2 is reportedly on track for a launch *this year*, bringing some seriously exciting upgrades. Whispers suggest a powerful new Bionic chip will be at its core, enabling incredible performance and advanced functionality. Get ready for a visual feast with rumored ProMotion adaptive refresh rates, promising buttery-smooth scrolling and graphics. HDR support is also expected, delivering stunning contrast and vibrant colors for all your creative projects. Adding to the intrigue, there's talk of a mysterious \"unusual feature\" set to redefine display interaction. This refresh promises to be a monumental leap for Apple’s professional monitor line, elevating your desktop experience!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTWJtb01pNDYtaTM0UmVUZGdiZnpQUURZeUdLMjNPbmUzNG1GVk5Fc3hhM3B6LVNCMGVQbF9sNnJKT2ZTVFRKRkw3eHQ3bUEzMFZhSlJCcDNaTzdtTWNwX2xTQzVVaXNGV3BHbVQwS0RJcHk5Q1MwYm9WLUF2cDY1VHlZcw?oc=5",
      "source_name": "MacRumors",
      "date": "2026-02-03T13:46:58Z"
    },
    {
      "id": "af91618a-2e1b-4c83-863d-a1d56df0cac8",
      "title": "Nintendo Switch becomes gaming giant's best-selling console in history",
      "summary": "The Nintendo Switch has officially made history, soaring past previous records to become the gaming giant's best-selling console of all time! This incredible feat cements its legacy as a cultural phenomenon, bringing joy to millions with its unique hybrid design and stellar game library. However, despite this monumental achievement, Nintendo's journey isn't without its challenges. Recent reports show a dip in company shares, fueled by concerns over memory shortages impacting production and speculation surrounding the highly anticipated \"Switch 2.\" Enthusiasts are buzzing, but the road ahead for Nintendo, balancing current success with future innovation, remains a thrilling tightrope walk.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9PeFdxNEdQN1ZvX3hEa2xWZGRWcmVJUHVjakdNUE5SQTBXS3cwb2VEbEo0Z3ZfUzFoZFF4dWJYUmxOMVpPYTNoMFdDNFZqdzlYbkFHRjg5dHUtUQ?oc=5",
      "source_name": "BBC",
      "date": "2026-02-04T11:51:29Z"
    },
    {
      "id": "4e11d956-9620-4d57-b328-7983c3f3709c",
      "title": "Microsoft rolls out native Sysmon monitoring in Windows 11",
      "summary": "Windows 11 power users, get ready! Microsoft is finally rolling out native Sysmon integration, a game-changer for system monitoring and security. No more clunky third-party installations – this powerful tool, long revered by IT pros and security researchers, is coming built-in. Sysmon provides deep insights into system activity, tracking processes, network connections, and file modifications, making it invaluable for detecting anomalies and potential threats. This move streamlines security, offering unprecedented visibility into your machine's heartbeat directly from the OS. It’s a massive win for enthusiasts eager to supercharge their defensive capabilities and truly understand what’s happening under the hood. A new era of Windows security dawns!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNSW01RVVsVzFxYzduUjVlLTlCQjlGbW1FaWN6RHROVWRhTE41enNIUWZkaEZrRThDbGhLV1FFWjIzVGloSlItdVF3dzYzQXk4U0sxYkFERXdhc2t5cmpqRUVWaVRCSENYWlkwcXdjM3drVW1ULVAzSEdpdVkzWk5XRDQ5R2x3c2c4R21HakZfT1BQRHRpbXcwWGFtYjk1UVZFM0RIbkIwV2tVM1JIUmN4MlBWd9IBuAFBVV95cUxPZ2dFeXBQTTFNUF9HSXlyLTZOX3hmenhGcm84cWdWZExHWGRvcVlhOVBfNTRDb2tHMElHMllCT05wWmVqcmVNRjZVcXVuRnA5b0ljbHk2ckNSdktGTkQ5SjFVbTZ1bUg0YzAtRkc3TDNNQVZTVm5CSjVWSWptRV95MnQ4SElYb1NFd0NFVzFlUE1uQUVadTdEOFZUbTRWVjB1RDV0U2dWUDQ5X2p3VXRUT2NENTRWOWxT?oc=5",
      "source_name": "BleepingComputer",
      "date": "2026-02-04T12:58:20Z"
    },
    {
      "id": "1b226fe1-0408-4b5a-81fb-b11b29260e0b",
      "title": "You Should Change These 3 Apple TV HDMI Settings For A Better Picture",
      "summary": "Apple TV owners, prepare to unlock your display’s true potential! Your beloved streamer might be leaving picture quality on the table, but a few simple tweaks can elevate your viewing experience. Forget settling for dull visuals; this essential guide reveals three crucial HDMI settings you absolutely *must* adjust. We’re talking sharper details, richer colors, and silky-smooth motion that will make your content pop like never before. Dive deep into your Apple TV's video output menu and follow expert advice to calibrate your setup for optimal performance. Stop watching, start experiencing – your eyes will thank you for these game-changing optimizations!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiakFVX3lxTFAwN3diMWloMVI2NVZYa285ZkVrQWgzMEoxUkJzQWtRUENrZ2NCWUdJeWhsbl9CSE1BQXROOW9xSG91SzlCeFBOV3VvV0FxblRyRFFuVlNQOXllZ2QwdmFEclg0SThnbkRqMGc?oc=5",
      "source_name": "bgr.com",
      "date": "2026-02-03T16:47:00Z"
    },
    {
      "id": "acef279d-01ef-4f4a-9516-2645e1c196ae",
      "title": "Overwatch 2 Is Ditching the '2' Amid Launch of 'New, Story-Driven Era' With 10 New Heroes",
      "summary": "Overwatch 2 is officially ditching its \"2,\" rebranding as simply \"Overwatch\" for an exhilarating new chapter! Blizzard is ushering in a \"new, story-driven era,\" promising the game's most ambitious narrative yet. Fans can brace themselves for an incredible content injection, including a staggering ten new heroes set to completely shake up the meta. This isn't just another update; it's a fundamental reimagining, aiming to deliver the experience the game was always meant to be. Prepare for deep lore, fresh strategies, and an epic ongoing saga that will keep enthusiasts hooked. The future of Overwatch looks brighter and more expansive than ever before!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxObG5wX09sUlBPZ0FfR1BzMkNoWVB6Vm94NzJUZkFhd3hac0ZyXzRKTUtyY1pVRTZIYkxsU3dic3RBTEFJZU5FQWtFZTktcjJURE1qS1MzMy0wcnVzRE1QSDNfVlQzUHNhcEE1aWhXcVNuNXBTR0V3Yk83SGUyS1YxRlhrZXpfWVZJYzFxRDQ1OXpBRGRjamhnM2kzaVRKMUM0aGMyQ0J5Y3pxZHpBTDdWMTBtYw?oc=5",
      "source_name": "IGN",
      "date": "2026-02-04T16:45:00Z"
    },
    {
      "id": "9310a3d1-5fc3-4c40-bd9d-e5c59be2a7fa",
      "title": "Xcode moves into agentic coding with deeper OpenAI and Anthropic integrations",
      "summary": "Hold onto your keyboards, developers! Xcode is leaping into the future of coding with groundbreaking, deeper integrations from OpenAI and Anthropic. Forget basic autocomplete; we're entering the era of 'agentic coding.' This means powerful AI tools like Claude and OpenAI's models will act as intelligent co-pilots, not just suggesting code but actively assisting in development – understanding context, generating solutions, and debugging complex problems. Imagine your IDE collaborating dynamically on your projects! This revolutionary update transforms Xcode into an incredibly powerful, intuitive environment. It promises to supercharge productivity and redefine how we build apps within Apple's ecosystem, ushering in an exciting, AI-powered development era.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPc09Ka2NTWlBMZnJ4M2M2ODhSVnlaWC1KSXhnRFJDQml6UjBWUUlYQWtGcnpUTVNrUGZpS3VPQXFVNmlQMUwzaEVuWldOQlZYS2EzenRmeTVzMFhTMGU2bnlxQjN5cE02X1R1LUJhV2pTN3NxNWo4NWFLQkxEV3ppR1hTbkRFeHpDdUY5NGdNOWtvU3lPUkpSdHZlN2szSGVZZlFoek13N2R6SzhzTE16bjhn?oc=5",
      "source_name": "TechCrunch",
      "date": "2026-02-03T18:00:00Z"
    },
    {
      "id": "d1e35cba-7657-4e89-9ef3-ecf14e585d62",
      "title": "Nintendo Shares Plunge 10% After Weak Profit Spurs Margin Fears",
      "summary": "Nintendo just took a huge hit! Shares plunged 10% after the gaming powerhouse reported weaker-than-expected profits, triggering concerns over future profit margins and potential memory chip shortages. This shake-up arrives despite the monumental success of the Switch, now confirmed as the second best-selling console ever, trailing only the PS2! While Nintendo maintains its forward guidance, analysts are scrutinizing potential headwinds for future hardware production. Enthusiasts are now watching closely, wondering how these financial tremors might influence upcoming blockbuster titles or the eventual unveiling of their much-anticipated next-generation console. What's next for the gaming giant?",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQckN3T0VJcE1aWlRHUGJFNUxlYlcxc1BYc1R0X0dpRkZIMkRYWlFtRVlmQ3hkMnR2eW94aC1UQ0ZPbzJmV1NEaHdfUE9jNXdvRHVuLWhieTVEYjhqRFV1aFVZdHpUZ2xJZGN2aVA2cWRmWHhzZFFaN2hIZFdmWFhjNTJ5TGRxalhZbDIxdEx4N2ZpeHh6SklzMlZ4OWVRc1FDMW1VU1I4MEpvSzFrOWdNcU12RW4?oc=5",
      "source_name": "Bloomberg.com",
      "date": "2026-02-04T03:55:00Z"
    },
    {
      "id": "7a448c7e-aecc-4e10-a4be-f9ae2ede9893",
      "title": "I Bought the Galaxy Z TriFold for Over $3,000. Follow Along as I Test It (Live Updates)",
      "summary": "Get ready, tech fanatics! Samsung just dropped a bombshell: the groundbreaking Galaxy Z TriFold is finally here, and it’s turning heads and wallets. This innovative device, boasting a nearly $3,000 price tag, defied expectations by selling out almost instantly. It seems enthusiasts are more than ready to shell out for truly exciting innovation. A brave journalist has taken the plunge, buying one of these cutting-edge tri-folding marvels to provide live updates and a hands-on review. Prepare for an in-depth look at what could be the future of mobile tech. Is this the ultimate foldable, or a luxurious experiment? Follow their journey to find out!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5xd3NXb05sc2tndTl3b1BSRFA2TVJqSncwcU1GM3BsUmdTVlVidGQ3ajFxYUhnZHBTY0xiOWpKRk4tc0pOUWFlMXNMMHlYd1dJcE1VZ1UtdTB3blpLd0o1N2Jlay03Q2RIR01LVmtEdUxJZmxpQnU1SS1kaw?oc=5",
      "source_name": "CNET",
      "date": "2026-02-03T14:10:00Z"
    },
    {
      "id": "2528697a-65ec-43ff-a91f-9911ea7b6410",
      "title": "Nintendo Expands Switch Online's Game Boy Library With Two More Titles",
      "summary": "Nintendo Switch Online just unleashed a double dose of retro goodness, expanding the classic Game Boy library! Gamers can now dive into two beloved handheld gems, instantly expanding their portable nostalgia trips. Get ready to soar with **Balloon Kid**, the delightful sequel to the arcade classic Balloon Fight, offering more high-flying adventure and unique aerial fun. But that’s not all – puzzle fans rejoice as **Yoshi**, a charmingly addictive block-matching game developed by none other than Game Freak (yes, *that* Game Freak!), also joins the lineup. It’s a fantastic refresh for the service, bringing beloved handheld history to your Switch. Time to fire up those virtual cartridges!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOOU9NT1U1WXg2VEU1ZEwzVUpBc19zRUtXYXA0VndqckNsOEhiWThTQUlZOUc3c2tadjdvZ085M09yVklJaXRwWldNYzg0XzQwSWFPV19LQWtYVWtSMUxrNzFXS1ExLUxLaG5lQjlCUnBMSVllVUV5QUNzZlZsd2ZPa2FXQTZ5eXZrVDk3UFM4OVU5RUlRTlJLN1QzakNsQUF5bTBtcXNSdVZBSl84OUliSg?oc=5",
      "source_name": "Nintendo Life",
      "date": "2026-02-04T01:05:00Z"
    },
    {
      "id": "213cfad1-a9be-4067-89ec-e20846a90ad9",
      "title": "The four best Super Bowl TV deals we found",
      "summary": "Get ready for Super Bowl LVIII with epic TV deals! Tech enthusiasts, now's your chance to snag a cutting-edge display for the ultimate game-day experience. Retailers are slashing prices on top-tier smart TVs, including stunning OLEDs, perfect for crystal-clear action and truly immersive viewing. Don't settle for mediocre! These limited-time offers mean you can upgrade your living room into a stadium-worthy spectacle without breaking the bank. Imagine every touchdown, every commercial, in glorious high-definition. From vibrant colors to lightning-fast refresh rates, these TVs promise to elevate your watch party. Act fast – these game-changing deals are kicking off soon!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPU1pJVFdTZU85TDRLbmhiX3hFS0lNRms4RWI4c243RUFTVWZvMlhrcUo0X1RKQUR2bHIzTDNYS2c2QWlWcXFvSXU3bHI5WWQ5TUpXU3FPeGRtbl9PQUZ5TFNfUnhqb3o0dGJMMTJLeENhYjB5SHNER3BrUzQycm95cQ?oc=5",
      "source_name": "The Verge",
      "date": "2026-02-03T21:23:36Z"
    },
    {
      "id": "8805a994-7998-422d-a779-a3358ada9889",
      "title": "Samsung’s Galaxy S26 Ultra renders showcase all four of its familiar colors",
      "summary": "Hold onto your hats, Galaxy fans! Early renders for the Samsung S26 Ultra have hit the web, giving us a tantalizing peek at what’s coming. Expect to see the familiar, sleek color palettes we've come to love, showcased across its stunning design. But it’s not all sunshine and rainbows; some early leaks suggest a potential disappointment: the S26 Ultra might skip built-in Qi2 magnets, a feature many hoped for. Despite this, anticipation is building for the 2026 Unpacked event. These latest leaks and exclusive specs hint at a powerful device, promising significant performance upgrades and a refined user experience. Get ready for another flagship contender!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQYWU3LUhfQXJwbnpOeFdySm00aU9mWnB2d3l1Vjl4SlpORFNhMWpIbGNvdkVNSnVTa0x4eXRoNFV1TjROM1pVZkRYdTVVRDQ3MVhIejBoRFB4MjlfSjJ1MUVRd0tYeVlDWk04TjkwUm5sRFZ0SXpnOFFYMC12SE5DWUVLOGJwa25EOXZKSEhDRmZnaF93MEpTSjVERmE4VGZCcHhfWkdjSVN0dw?oc=5",
      "source_name": "9to5Google",
      "date": "2026-02-03T15:14:00Z"
    },
    {
      "id": "6e8eff50-dde4-4808-aa51-838e129c211e",
      "title": "Secret Lair: Roll for Initiative Superdrop",
      "summary": "Get ready, Planeswalkers and adventurers! Wizards of the Coast just unleashed the Secret Lair: Roll for Initiative Superdrop, a thrilling Magic: The Gathering x Dungeons & Dragons crossover event! This drop is bursting with incredible new cards featuring fan-favorite characters from Baldur's Gate 3, including Astarion and Shadowheart, reimagined with stunning art. Not only are we getting iconic D&D heroes, but this Superdrop also includes powerful, high-value reprints of popular MTG cards, all adorned with gorgeous D&D-themed artwork. Prepare to bolster your decks with these collectible treasures, merging two legendary universes in one truly epic release. Don't miss out on this fantastical fusion!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPVU41R0ZCTmI3c3FVTGtFOEhSLXU5bmRkekkwS0stMlNBN29ZMkNuRUdiQ2l5RFFVSVlkN18wbWs2RTZtcXdtSlAtSlRGNV8tMUlvZ283R0l4dS1pMUVJdkpNbEsxb1ZicXlOYXpFdmNhOEdxN21PV09wR0NDc3YzZU92ckFERS1hNjdYODZMV2tQeGc?oc=5",
      "source_name": "Magic: The Gathering",
      "date": "2026-02-03T18:32:03Z"
    },
    {
      "id": "55cc9451-3a4b-403f-b18e-137895525de8",
      "title": "Stardew Valley Turns 10: The Big ConcernedApe Interview",
      "summary": "Stardew Valley celebrates its tenth anniversary, and creator ConcernedApe sat down for a huge interview, revealing incredible news! Get ready for a massive 1.7 update that promises to overhaul the beloved farming sim. ConcernedApe admits the game might \"never be done,\" hinting at endless future content. This colossal patch will introduce not one, but *two* exciting new marriage candidates to romance, adding fresh relationship dynamics. Plus, children will become \"a little more interesting,\" making family life in Pelican Town even richer. And get this: a secret has been hidden in Stardew Valley for a decade, still undiscovered! The journey truly continues!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQQWd6aGg3MXVBM3VMMWo2RE45NWFQNXFEMnBDb3BiRndFNklGcFNPUVNISmdsY1Q3c1VLblg0RDhodVFKMXNMci1tSlZHMU1ESHRQN1FNd21KdjhQMEptUG1JNGN2dUNtWFY4b3BnMGJPMVpLOTI2Q240akhETFBjOXUwanMwYmYtQVFR?oc=5",
      "source_name": "IGN",
      "date": "2026-02-03T18:24:30Z"
    },
    {
      "id": "77e5fd19-fa58-41fd-832d-cda99f92e51a",
      "title": "Hackers Crack ‘Fallout Remaster’ Countdown, Fans Left Disappointed",
      "summary": "The wasteland faithful just got a dose of Nuka-Quantum-sized disappointment! Hype reached critical mass for a rumored Fallout 3 or New Vegas remaster, fueled by a mysterious countdown timer. Fans, ever hopeful for a modern refresh of these iconic RPGs, keenly followed its progression, especially with the phenomenal success of the Fallout TV series. However, hackers quickly cracked the countdown, revealing not a glorious new beginning, but an anticlimactic dud. Instead of a shiny, remastered journey back to the Capital Wasteland or Mojave, players were met with… nothing. A brutal reminder that not every countdown always leads to a cherished announcement. Ouch.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQNEliOERFN2NFYy1xVXVhNGZ2MjJINGxWbnVkN0gyOFYyR2xjYVJsZkZjN0l2Sm1YTy0zV2Z0Y2VEZWRHZUlHeTEzRGpYSHh0ajRCX1BqNTJPdHJ3WnN1U2RzNHp2UTlrXzRpNUhlVzJQc05EOGd1enozd25pa3RGLTFBS0VpUTZNT3ZTTmNHOWNZYlk?oc=5",
      "source_name": "GAMINGbible",
      "date": "2026-02-03T16:32:09Z"
    },
    {
      "id": "042461a1-cbd7-416e-8753-2894bb5d9642",
      "title": "Foldable iPhone Design Leak Reveals You'll Need To Relearn How To Use Your Phone",
      "summary": "Foldable iPhone Design Leak Reveals You'll Need To Relearn How To Use Your Phone bgr.com iPhone Fold: Launch Date, Price, RAM Limits and Everything We Know CNET Apple is working on an 'iPhone Flip,' report claims Mashable Fresh leak offers new details on the upcoming folding iPhone Macworld Apple Is Working on a Clamshell Version of Its First Foldable iPhone, Report Says CNET",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNRnpLZlFsZDB5S0pjV2VGWTB5M2JwUlAyOUpZc2ZsSmc0WWZTa2FZMmZvMDUwdTVQSDRqb184b19LQ2hvYVZPdjBnM2NuNXdJLS1vSGhycE5DTmxxbTNhQmdCdEh5VGJJNm8tYVkxREhqTnFfTGV0YUZsYTFOUWZvMWhoQQ?oc=5",
      "source_name": "bgr.com",
      "date": "2026-02-03T18:40:47Z"
    },
    {
      "id": "f971f3a0-37b4-414a-8e98-120c8a8406e4",
      "title": "Nintendo net sales up 99.3% as Switch 2 shifts 17.37m units",
      "summary": "Nintendo is soaring to new heights! Their latest financial report reveals an astounding 99.3% surge in net sales, showcasing the incredible, sustained demand for their flagship console. The Switch family continues its phenomenal run, with an impressive 17.37 million units sold recently, catapulting its lifetime sales past the legendary DS to become Nintendo's best-selling console of all time! This isn't just about stellar numbers; it’s a powerful testament to the Switch’s enduring innovation and captivating game library. Despite market challenges, Nintendo’s robust performance confirms its industry dominance and promises an exciting future for enthusiastic gamers everywhere.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQS2FuSERheEtnNkNBWS1hZlhNb2I2RFdnVDAzQzFMZ0Q0ZVZnRmtoT2NZWUo0ckJDd1hJa2ZYT2JQZ0MtZFZpa18zMkhfVTh5dEVlWnZyUDNXcGluaTc2U2F6QzhkdnVKeGMteVFDY3VldEV2X3o4QjZRTlloOFJKYlM1S19kQ1pXRXlHbFdVZw?oc=5",
      "source_name": "GamesIndustry.biz",
      "date": "2026-02-03T10:09:38Z"
    },
    {
      "id": "4891422f-e597-422d-a6f9-178c7193607f",
      "title": "Samsung Galaxy S26 Ultra Release Date: New Leaks, Disappointing News",
      "summary": "Tech enthusiasts, brace yourselves! Early leaks for Samsung's Galaxy S26 Ultra are dropping, painting a mixed picture for the upcoming flagship. While anticipation builds for Unpacked 2026, a potential letdown is the rumored absence of built-in Qi2 magnets, a puzzling omission for wireless charging fans. On the flip side, early listings tease exciting color options! Price leaks suggest a bittersweet reveal, reassuring some wallets while shocking others. Expect cutting-edge power and design, but maybe some compromises. Stay tuned as more details emerge for Samsung’s next premium device, promising innovation with a few unexpected twists.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPcDZKcUlvYVk4TExmR29RdDhQLUdFY2w5V1ZhMnZlQVlPVjVFa0I3dms3VGtqMkhYX0Vjb0JjSmFPMVo1ZzlWcjc3bWx2UUg0b2Z6LVBpVVpzU0NRVE85bXJQaWFHMFRXa2xmVWlHWlZVTlBqVkZTYUt0dm1CajMtdmVITTcwUk9qUUR2LWdsSWM4cHNfOTVPOVRhbTYwNFgxdGtCdUJDZmdyMlh3?oc=5",
      "source_name": "Forbes",
      "date": "2026-02-03T14:44:00Z"
    },
    {
      "id": "6e8ce6ef-cad8-422c-b711-fa609295c263",
      "title": "Fitbit founders launch AI platform to help families monitor their health",
      "summary": "The visionary minds behind Fitbit are back, revolutionizing family health with a groundbreaking new AI platform: Luffu! Moving beyond individual tracking, Luffu empowers entire families to proactively monitor everyone’s well-being using smart, connected technology. Imagine AI as your family’s digital guardian, providing vital insights and timely alerts to ensure safety and catch potential issues early. This isn't just another health gadget; it's a comprehensive, intelligent ecosystem designed for modern caregiving. For tech enthusiasts, this represents a significant leap in how AI can seamlessly integrate into our daily lives, truly transforming family health management into an interconnected, cutting-edge experience. Get ready for the future of care!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNNFNkUEMyWFZkU1dsdndIQ05yRnZ6NVc2ZVlsZjdXLUI0a2RNVkpHeDNIZ3RCeXNXZFlkM0pFOGZ6azdnVXVkNVRfLTQ3WHl0UkNwVV9vdTFFalhSQllZUUNibV83cFRuU3BiVmZrZ0RUdmhwYy0wMEphMkdNVGh6X2VkS3I1bXJFYVFzZFNRaGgySm9KOEhkNXhTUGNjalN6eHBicjdvQXJ3UUk?oc=5",
      "source_name": "TechCrunch",
      "date": "2026-02-03T15:53:36Z"
    },
    {
      "id": "2d30ac3f-89b0-43d3-a5bd-f7b0282cfac4",
      "title": "Google Home finally adds support for buttons",
      "summary": "Finally! Google Home users, your smart home just got a whole lot smarter and more tactile. Google Home is officially rolling out support for smart buttons, a game-changer many enthusiasts have eagerly awaited. Forget fumbling with your phone or shouting commands! Now, a simple press of a physical button can trigger complex routines, control lights, arm your security, or execute any custom action you’ve set up. This dramatically boosts convenience and accessibility, making your connected gadgets feel more intuitive and integrated. It’s the upgrade that brings a satisfying click to your automated life, streamlining daily interactions and elevating the Google Home experience to new, effortlessly interactive heights. Get ready to button up your smart home!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1XVkNhMG9peGJYb3Vrak5Xa1dZdEFlSEtPdXJWcnBvVUF3NGdxTVV2Tm1BOGR3WnNscjNyajZYN2tGSGJOV0JRcV9rcHpieG82TGQ2RFRHLUNFWHlTRFZMMGwxX2dJUmlYaEl0RG1QOFhBSkRHNENBYjFpMA?oc=5",
      "source_name": "The Verge",
      "date": "2026-02-03T13:50:56Z"
    },
    {
      "id": "6a76d821-5a1b-4ef5-9196-55d5551f70c0",
      "title": "As a Virtual Boy owner I can confirm the Switch 2's NSO offering is alarmingly accurate and an essential history lesson",
      "summary": "Get ready for a truly mind-bending retro trip! The upcoming Switch 2 is rumored to resurrect one of Nintendo's most infamous failures: the Virtual Boy! Early hands-on reports confirm an \"alarmingly accurate\" NSO offering or even a dedicated accessory that perfectly recreates the original's bizarre, eye-straining red monochrome experience. Far from a simple nostalgia play, this isn't just gaming; it’s an essential and fascinating history lesson. Enthusiasts are excitedly sticking their faces into this surprisingly faithful recreation, discovering the oddly comforting, yet undeniably strange, blast from the past. Prepare for Nintendo's strangest comeback!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE92YjUxY3dGWUUweE1DNjZ3UHRTYllOWVk2U0NrYjZuUXVOa29wcUFTR3BqbEI3VDRJY1g1YUZTb1NaOTRkRVFFcENqNWJBeFpBVGRJaXpmTQ?oc=5",
      "source_name": "Eurogamer",
      "date": "2026-02-03T14:00:00Z"
    },
    {
      "id": "b6365dde-79ef-4ddd-b094-0f98865980c0",
      "title": "Samsung updates One UI software rollout roadmap – February 2026",
      "summary": "Hold onto your Galaxies! Samsung has just unveiled significant shifts in its One UI software roadmap, and not every phone is getting the same VIP treatment. Enthusiasts, listen up: older flagships are facing tougher news. The beloved Galaxy S21 series is officially bowing out of future major One UI updates, marking the end of an era for many. Meanwhile, the Galaxy S22 and S21 FE models are being shifted to a slower update track, meaning longer waits for those sweet new features and security patches. This strategic move impacts millions of devices, so check your model. It’s a wake-up call for those clinging to older tech – time to consider your upgrade path!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiggFBVV95cUxORC1UOGVaelNRb2N4OGw4QXZfM3lpblZvX0d3aEJuVWJocTNUYmNfQ1QyWUMtb1Zid3BDS01HMFk5cjl2LXlXQnYxUlVjTGpmQjR2bExFbGtOM1g5NHFTVjZyU0ZWUVl3RnB6NnhZSlUzejNuSVVZRG0zbVhpSFROV0Nn0gGHAUFVX3lxTE1oSEVVZ1FLbWw2b3AxWVJ1OWNSbkF6N3loclRTVU1SWWdFRlFiRDBhaVdCVV9MRGNVUWJYVVBFRDdmZThYd2FZaG8wOGlKeU9SaGdYUzZuaDVhV1dnUlQtVkwwRUNzZW9XS1U0d0taV0VSRWxzRVl0Y3REbmxmUWlNanRpZzZGOA?oc=5",
      "source_name": "Sammy Fans",
      "date": "2026-02-03T05:22:45Z"
    },
    {
      "id": "03564c9f-cef9-4fa3-ac88-9c3bda3cf5b2",
      "title": "Gemini Live rolling out floating pill redesign on Android",
      "summary": "Google's Gemini Live is rolling out a fantastic new update for Android users! Get ready for a sleek floating pill redesign that revolutionizes how you interact with your AI assistant. This intuitive, persistent UI element keeps Gemini Live accessible directly on your screen, no matter what app you’re using. Imagine seamless multitasking: dictate notes, get quick info, or brainstorm ideas without ever leaving your current task. It's designed to make your AI companion an always-on, dynamic presence, significantly boosting accessibility and user experience. Tech enthusiasts, prepare for a more integrated, powerful smart assistant experience right on your phone!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMickFVX3lxTFBzWGxLbUo2Q1JueDBNbHdCYXJ5VXJMcmFLMHN2ZjVvcEVwdVRVVTlZeHprd3NZQUpQWl9VX0xiYURPVndlaFljcVBjSWZndGotVUxqT3U2dGFyanpzZDQ3WlFhU3R2Ry03ZzdWWVBIMjhKQQ?oc=5",
      "source_name": "9to5Google",
      "date": "2026-02-02T19:33:00Z"
    },
    {
      "id": "b51a1ba5-31e5-49b0-bb73-663d0c8f22f5",
      "title": "Galaxy Buds 4 may not have Galaxy Buds 3 like quality and reliability issues",
      "summary": "Get ready, audiophiles! Samsung's Galaxy Buds 4 series is on the horizon, and leaks are spilling serious beans! Fresh renders reveal stunning designs for both the Galaxy Buds 4 and the premium Buds 4 Pro, the latter even accidentally confirmed by Samsung itself. Excitingly, whispers suggest these new buds could finally leave behind the frustrating quality and reliability issues that plagued some earlier models, promising a much more robust and dependable experience. Leaked prices give us an early peek at the wallet impact, while rumors point to a welcome return to a classic charging case design. Prepare for an audio upgrade that’s shaping up to be truly spectacular, hitting all the right notes!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQM3hNalZOYVJUbFQyMmdGQmc0T1ZJTXI0eVBiLUVzMzhXYW5COGVQMzNsM0RPSEN6RnVBclBiWVB3cnF0T1VtRkV2UVkxX052Q0lobVY1TFNGMnBBeGNMbzYwS1ViamRxOWVwNWs3SHJPR0szdjViZmNKam5iZ1ByeEZHUjBTWFdHLUlJ?oc=5",
      "source_name": "SamMobile",
      "date": "2026-02-03T05:02:00Z"
    },
    {
      "id": "926f8e72-85d7-4af4-ba84-04fed336ef27",
      "title": "OpenClaw Bug Enables One-Click Remote Code Execution via Malicious Link",
      "summary": "Brace yourselves, tech warriors! A critical new vulnerability, dubbed OpenClaw, is making waves, turning your digital world into a potential minefield. This isn't just another bug; it’s a \"dumpster fire\" according to experts, enabling devastating one-click Remote Code Execution (RCE) via a simple malicious link. Imagine, one wrong click and attackers could gain full control, pushing nasty password-stealing malware directly to your system, especially targeting macOS users. This dangerous flaw leverages AI agents like MoltBot, making it incredibly insidious. Security researchers are sounding the alarm, urging everyone to stay vigilant. Your clicking finger could be the weakest link!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPdkhmMlQxeG1DZjdDb2lDOVFlZ054YkRqNlIwUVdKRzVNU2d2LXltYzZvZnpKRzluVDhjTmFPbnhQV0d0YnJ2YU45MXlzU0VoNFNUUDl6NzAyU1FzTGlUMFloWXdUSVRsMUhLS1dwYmVOTVc0dFBPc2VHZ04xdVVUVlVR?oc=5",
      "source_name": "The Hacker News",
      "date": "2026-02-02T16:28:00Z"
    },
    {
      "id": "6582a569-ebeb-4e12-ae75-5adb35965053",
      "title": "Android 16 QPR3: Pixel adds Adaptive Connectivity auto-switch, battery settings",
      "summary": "Pixel fanatics, brace yourselves! Android 16 QPR3 is landing, packed with intelligent upgrades for your devices. The standout is Adaptive Connectivity, an auto-switch that seamlessly shuffles between Wi-Fi and mobile data. Say goodbye to dropped calls or buffering as your Wi-Fi falters! This smart system guarantees ultra-stable connections, optimizing performance effortlessly. But there’s more; revamped battery settings are also arriving, promising enhanced longevity and granular control over your phone’s power usage. Prepare for a noticeably smoother, more efficient Pixel experience. This isn't just an update; it's a significant leap forward, making daily use even better for enthusiasts!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBxdHlfMWxlMUdpSGpPQUFrRVpZWGZQdG5RcXFtMkYwcEtVTldFaEZ2SmttaE9WSzlBTFhhcGhjaXJCb2gtMmlma1N2OHFpMjVSLWhfa0NFT3g1Ym52VXVEdXVYbFhiZ2ZtWjQtUGJjdDN6ZFkxd2ZWOFRzWQ?oc=5",
      "source_name": "9to5Google",
      "date": "2026-02-03T00:54:00Z"
    },
    {
      "id": "d7647909-b5cf-4a0d-b7be-321328ab32d0",
      "title": "Adobe Animate is shutting down as company focuses on AI",
      "summary": "Hold onto your stylus, animation fans! Adobe Animate, the beloved tool with a rich Flash legacy that shaped countless web games and animations, is officially sunsetting next month. This isn't just an update; it’s a seismic shift as Adobe aggressively pivots towards generative AI. Creators, from seasoned pros to aspiring artists, are feeling the pinch, wondering about workflows and future projects. Many are expressing frustration at losing a program that defined an era of digital content. While AI promises exciting new horizons, the immediate impact on the animation community is a big question mark. Get ready for serious recalibration in the creative tech world!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMilAFBVV95cUxORFdFdEJTX0FrdTBZOHZGREJuU1pNeFlVQW9UMmFtQ2l3Szk1VnR1N0lSWERPUTdva2VLQTd0RzR6NjZIenJZbFZ4UmtUV2RqVy0tLWZGcTJJRGtHQTJlTHRBYTJWc2xCcTBGSGc5LU5KQUhBREdZZmhaQlMwb2Fjb1pzVHcxN3Utc2F0OUtrRnlEaDZz?oc=5",
      "source_name": "TechCrunch",
      "date": "2026-02-02T21:15:03Z"
    },
    {
      "id": "8b9e4935-1e41-4ec9-b795-7c3342947198",
      "title": "New iPhone Fold specs revealed, including design, cameras, more",
      "summary": "Get ready, Apple fans! Exciting new leaks are spilling the beans on the upcoming iPhone Fold, and it sounds truly revolutionary. Expect a stunning new design, potentially a sleek clamshell 'Flip' style, moving beyond traditional iPhone aesthetics. Camera upgrades are rumored, promising even more incredible photography. Perhaps most thrilling are hints about groundbreaking battery life that could absolutely dominate the foldable market, leaving Android competitors in the dust. Even button designs might see a radical shake-up, signaling Apple's ambition to redefine the foldable experience from the ground up. This isn't just another iPhone; it's a peek into the future of mobile tech!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNeTVLS2hETDdRYlpRdXp0VEVFZ3d2Mkd1bFRDcHBfQmdHVnVaRU9yMlpwdlZYb3ZjX295VVVldFlSU2JsRnBpWm1NVXFxYWhpOEFSZmR4YVdoaEZ6NzN6MDdSck1wN0c5WFp3YlN4dzVldWlsTXAtR1h6SmRxa2tTSk1jc1k0R0dzMjJwM3Y3SGRFSy1XeXM0?oc=5",
      "source_name": "9to5Mac",
      "date": "2026-02-02T15:50:00Z"
    },
    {
      "id": "e2663d46-3f1c-492c-9fad-97e3a2204bf2",
      "title": "Firefox is adding a switch to turn AI features off",
      "summary": "Attention, tech enthusiasts! Firefox is making a bold move, putting unprecedented power directly into your hands. Get ready for a game-changing 'kill switch' that lets you instantly disable ALL generative AI features within your browser! That's right – no more mandatory AI tools if you don't want them. This isn't just about privacy; it's about giving YOU ultimate control over your browsing experience. Whether you're an AI skeptic, prefer a lean browser, or simply demand the choice, Mozilla is listening. This exciting update reinforces Firefox's dedication to user-centric design, making sure your digital journey is precisely how you want it, AI or not!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNUUtrdmNaUjIzMGx6eFVhNlMydFpwaUYwSmNZcWV4ZWk0NnpLdDR3OWMtUFZOc1dJQU4wTnBqS0dtX3RlYkVMQnlSV2E4Y292Ykk0eFBNWEl1RnhoN01rRXcyc3pLNXp1Y1RyMzkxb2tLZVVtd2FUcS1lbHpmSVVsZg?oc=5",
      "source_name": "The Verge",
      "date": "2026-02-02T20:02:39Z"
    },
    {
      "id": "7ea32cbc-0e52-4752-9d8d-787549d19180",
      "title": "Galaxy S26 is likely skipping built-in Qi2 magnets in latest leak",
      "summary": "Hold up, Galaxy fans! Fresh leaks suggest Samsung's upcoming S26 might *skip* integrated Qi2 magnets. This could mean no native MagSafe-style accessory compatibility without a special case, potentially leaving Samsung behind Apple's seamless ecosystem for chargers and wallets. But don't despair! The S26 Ultra is still rumored for a massive camera overhaul, promising incredible new photo capabilities to elevate your mobile photography. Plus, whispers of an S Pen redesign hint at exciting new functionalities, pushing productivity and creativity. So, while one anticipated feature might be a miss, Samsung is clearly cooking up some serious, exciting innovations for its next flagship. Get ready!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNZDFsZjNvNUxMbHp2WVdiVmtyOE5CdzNVd1dyRFd2ekxPaG9xVjZFdUJlalo0M0VTd2c2ejlqZ1p3clZuYTZ2eDJxc2xkYkZmUVVtWjBvdFFEVlRqa1hUYU9ieFppUDBkVWdWNl9nOGFmX0NOQndiREdhQjVyVGI1VFdicW0wVkM1eVNxOF9WbGFSYmNhS1FyYg?oc=5",
      "source_name": "9to5Google",
      "date": "2026-02-02T19:20:00Z"
    },
    {
      "id": "6f06ea72-f4ee-4355-84d7-77f26d860fec",
      "title": "Then and Now, Part 2",
      "summary": "Dive deep into the shifting sands of Magic: The Gathering history! This electrifying retrospective revisits the legendary Pro Tour Lorwyn Eclipsed, examining how its meta-defining decks and strategies compare to today's evolving landscape. Remember those groundbreaking Mirrorform combos or the insidious Blight Curse Commander brew? We're peeling back the layers to see which innovations stood the test of time and which faded into legend. Discover the hidden genius of elite players, the seismic shifts in card power, and the enduring legacy of Lorwyn Eclipsed. Get ready for a nostalgic trip that illuminates the game's past and informs its thrilling, competitive future!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1CQ18tNkE0NEhQZ2Fka3c2MVFFR3BfcF9QU016NjdLenJTckJjcmhGbGNPMFhxU2FJcDJ2UFp0aW1SZWUyU1FvQ0RjVVM5alBud2FRY3NHcnItbnhwaGtocUhjX3pjVFIyd1BkcUVTbUJVcHRO?oc=5",
      "source_name": "Magic: The Gathering",
      "date": "2026-02-02T16:37:32Z"
    },
    {
      "id": "d5e1feaf-a260-4b87-a99b-292f644c25df",
      "title": "Android Auto 16.1 Now Available for Download With an Unannounced Change",
      "summary": "Android Auto 16.1 has landed, and it's a big deal for drivers! This latest update swoops in to fix a frustrating \"squiggly line bug\" that wreaked havoc on steering wheel controls, restoring seamless navigation and media management. But wait, there's a surprise! Google has quietly rolled back the controversial new music player UI. While unannounced, this move likely addresses persistent control bugs, prioritizing stability and user experience over a fresh look. Get ready for smoother, more reliable in-car tech – download 16.1 now and experience the fix for yourself!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNVF9pS05UcW11WnQwaWxlWmNHRE90bE1XYjRxbi1heHU5MmhSY3lSYTZOazItRW42bktoZWJRR3pqOWVuZ3k1am4tTkJaVjc1VXZfX2ktUUc2MWVqR01FZ3BrcTc1d2YyTlZSS2xCQS1RTk9vZk5mSGRYR0JPTzlJd1kwTlp1QzNXQUVoNHk1aW9mb2xvTjk5X1hWSjJjY19PQTdVN2ltSFU1azFJZ0JLSEluUE1WQm03?oc=5",
      "source_name": "autoevolution",
      "date": "2026-02-01T16:14:55Z"
    },
    {
      "id": "17f97390-3f5f-4a12-8e8a-2a77599d4167",
      "title": "Roundup: Here's What The Reviews Say About Square Enix's Dragon Quest VII Reimagined",
      "summary": "Get ready, RPG fans! Square Enix’s Dragon Quest VII Reimagined is landing with widespread critical acclaim, and the reviews are glowing! This highly anticipated remake revitalizes a beloved classic, offering \"smooth sailing\" for returning adventurers and a perfect entry point for newcomers. Critics praise its faithful yet fresh approach, making the epic journey more accessible and enjoyable than ever. Expect stunning visuals, quality-of-life improvements, and that quintessential Dragon Quest charm. Whether you’re a series veteran or new to the world of Erdrick, this reimagining is being hailed as another fantastic addition to the legendary franchise, proving the enduring appeal of this timeless JRPG. Dive in!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOTEpiemxVaTktdGFINV9vNm1NY3BmaDlNdTVPN3kxT0ZXVERWbnlkeGlEUkY1OVRsVnVYYUdxWS1mV1hJckVvdHVQbGdLQ0NzMFd0emY0WGg0NE5ka2N2aXllSTVpb21rY0RVbzdzLXlia2N2V0ROVHd5NldjYmgwTTdqbW9CeEpVb2ZDdkpuU3ZNNElKRkhOQ2YtWUVEeUV1N2RrNnAtZWwyS3NYV1ZEdHA0N3FqT3pMa19z?oc=5",
      "source_name": "Pure Xbox",
      "date": "2026-02-02T16:30:00Z"
    },
    {
      "id": "37bb65f4-e1e7-40e9-a890-06b1233061d5",
      "title": "Holy Crap: Look At This V12",
      "summary": "Get ready to have your mind blown! De Tomaso just unveiled the engine for their track-only P900 hypercar, and it’s a masterpiece. This isn't just any V12; it's a jaw-dropping, 12,000-RPM beast that looks like it rocketed straight from a sci-fi blockbuster. Forget what you thought you knew about engine aesthetics – this marvel boasts an exhaust system so wild and visually intricate, it's practically art. Enthusiasts, prepare for an auditory and visual assault. It's truly one of the craziest, most extreme powerplants ever conceived, promising an unparalleled driving experience. This isn't just power; it's a statement.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5xWjNDZmQ3NlBDX0xvTDZJWEZEdWszTEwzX3FhY3RhXzBZY1dTSHU3enNLeS1CUHhESmRHUjRMc28yWVZDc2ZyZ3FFLVFTY1VnOUYtaGFJaUx6dkxiR01aanlHbGEtTkpXRjZTanJQN0hDekNn?oc=5",
      "source_name": "Motor1.com",
      "date": "2026-02-02T16:11:00Z"
    },
    {
      "id": "1a4d23e6-a88e-4bd4-ba80-3b06880ef830",
      "title": "Now anyone can tap Ring doorbells to search for lost dogs",
      "summary": "Lost a furry friend? Ring's groundbreaking \"Search Party\" feature is now accessible to everyone, transforming smart doorbells into powerful pet-finding tools! This ingenious tech-for-good initiative leverages Ring's vast network, allowing users to send real-time alerts to local doorbells, potentially spotting missing companions faster than ever. Previously in limited release, the program has already achieved incredible success, reuniting over a lost dog a day with their anxious families. It's a true game-changer for pet owners, harnessing the power of our connected homes for community good. Millions of Ring devices are now part of a nationwide pet-rescue effort. Get ready to turn your smart home into a neighborhood hero!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPMVdwRndKY2tDR29mNzVpUU5yU05fNnBKbldhWWc0SUpEaG04MWQ4a1gwMjNGUUxrWkg0TmNSakV4ZWV3YnlKUEx4UWNHeU1CY28tVG16VVpXQ0JBcG1nTmM1NEhLVU14NlBIT21xRk5KbVVjODNPeFItUkVkTHYzQ0NDMmZnQQ?oc=5",
      "source_name": "The Verge",
      "date": "2026-02-02T14:00:00Z"
    },
    {
      "id": "67285391-a051-4ac3-bbfd-13c0f1cb9912",
      "title": "2027 Ferrari 849 Testarossa First Drive Review: Don’t Fear the Future",
      "summary": "Gearheads, buckle up! Ferrari's 2027 849 Testarossa has broken cover, and it's a revolutionary beast. First drive reviews are hailing it as Maranello’s smartest supercar ever, proving the future is anything but frightening. This isn't just an evolution; it's a paradigm shift. Imagine a \"bullet with butterfly wings\"—blistering speed married to unparalleled agility and stunning design. Critics are raving about its innovative powertrain, seamlessly blending raw Ferrari passion with cutting-edge tech, delivering an intoxicating experience that redefines the supercar landscape. Get ready to embrace the dawn of a new era, where performance meets pure exhilaration without compromise. The Testarossa legend lives on, bolder and brighter than ever.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOb0lOZi1tZDVfNkY4UWxSU01hZHNUSEVLbFI5eDd1bU1zU3c5QnR6cXlmSzUwTDBkbnV2MjV0cTZBbk5RZGFic1VsVHlXbzdUTURseWVsVHBNZU4ya3NpNWZFOFZSd3pMY0N3Y0gwbVpVSFIydEEtVTBVeWNRR0h2bkdmaU5aNGZpU3RzSnVrcUV1ellZNlFEbFVWNW9Qd01qNzY2bm9xTQ?oc=5",
      "source_name": "The Drive",
      "date": "2026-02-02T16:00:00Z"
    },
    {
      "id": "65e94d60-7cfc-4207-8e1d-72afd140ece9",
      "title": "Apple's Foldable iPhone Rumored to Feature Unrivaled Battery Life",
      "summary": "Apple's Foldable iPhone Rumored to Feature Unrivaled Battery Life MacRumors Apple is already thinking about its second foldable iPhone, and it may be a clamshell Engadget The foldable iPhone will make sure future Galaxy phones have massive batteries PhoneArena Upcoming iPhone: A \"Flip\" Phone With a Square Foldable Design, Details Leaked The Mac Observer Apple’s Foldable iPhone Plans: What We Know About the Clamshell and Tablet Models WiFi Planet",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQdnV3aG1VQlU1ZjNsNlBOS1BPUjdZTmVlYmpvZDB3QVJRblBkU3FNYjNIZGRmZV9kOGQwUjJtbWoyYzF1SThZWDhvajBmZkpXTlB3RUY1MmZlOVJuWjRDempBMXhPT0FXUkJScExhdDlLU0NlbmpTcFdZS0ZZQ3NaMEJfSDg2MzN0anNIMU9qX0Q?oc=5",
      "source_name": "MacRumors",
      "date": "2026-02-01T17:27:44Z"
    },
    {
      "id": "093c3360-48e2-4b74-8a2e-44b73c64fb03",
      "title": "M5 Pro, Max updates for MacBook Pro expected alongside macOS 26.3",
      "summary": "M5 Pro, Max updates for MacBook Pro expected alongside macOS 26.3 AppleInsider Apple M5 Pro and M5 Max To Launch in March With New SoIC Packaging To Cut Costs TechPowerUp AI is forcing me to buy a new MacBook Pro Macworld Apple To Launch Its M5 Pro And M5 Max Chipsets At The Same Time When It Releases macOS 26.3, Which Is Currently In Beta Testing Wccftech New MacBook Pros Reportedly Launching Alongside macOS 26.3 MacRumors",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPMVBlVXVqQ2xlempDM1h3VkhtWHF4NUVHMUJqQkhHOFFQbThLS0lNSURBM0R1eE96Y0liMUJSY0pTc3dyT3RTcFBGQTVhdUJETmhUTl9ab3VSOEd0enZxem9IdDNyZXV0dlFGTUZKUW1nQ0hUWHFJNzhlalhIVkVJbXZQN0puRmlTY0s2THB1a3ZOVVhVSmtkc0NkSEdUNWV6czNFRjNsWHdtQQ?oc=5",
      "source_name": "AppleInsider",
      "date": "2026-02-01T15:15:54Z"
    },
    {
      "id": "38a98c0b-5382-4a7b-8c22-5883cee085ce",
      "title": "I Tested the New AirTag and Found That Apple More Than Doubled Its Range",
      "summary": "I Tested the New AirTag and Found That Apple More Than Doubled Its Range CNET Why your iPhone wants you to update to iOS 26.2.1 USA Today Apple introduces new AirTag with expanded connectivity range and improved findability Apple iOS 26.2.1—Update Now Warning Issued To Millions Of iPhone Users Forbes AirTag 2 vs AirTag: What's the difference? Tom's Guide",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE9seHg0dEVZQjNVenplN3JTRlpVdmxnQmliNVRfczBhV2JLbVhWUGJDcmFUUVJ1MkFCOEtlcGpUUjFJTkgzaTdZc1ZrTXFnc0hOYXQ3R2R3bzJ0dW9sa2c?oc=5",
      "source_name": "CNET",
      "date": "2026-01-31T15:31:00Z"
    },
    {
      "id": "5f6620f0-66e3-4e7b-978e-a00b82a12cfc",
      "title": "Day Two Highlights at Pro Tour Lorwyn Eclipsed",
      "summary": "Day Two Highlights at Pro Tour Lorwyn Eclipsed MAGIC PLAY Top 8 Players and Decks of Pro Tour Lorwyn Eclipsed MAGIC PLAY Then and Now, Part 1 Magic: The Gathering MTG Lorwyn Eclipsed’s Blight Curse Commander Deck review: a deadly brew ScreenHub Australia Pro Tour Lorwyn Eclipsed Standard Metagame Breakdown MAGIC PLAY",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMid0FVX3lxTE54NldaMC1aaXJ5ZTBXVm5NdWM1Qk9tZ1E5ZzRtYlB3TVhhNVo3NFVwQTN0anROSGlnaDNsY0R5N2p1a3YtQ3lxQ092Y2xxN2lSVE83SmwzWkdhTjBoNHloNlllUzFFMDcxQTNPbWloWG9Gamw4Y1FZ?oc=5",
      "source_name": "MAGIC PLAY",
      "date": "2026-02-01T04:29:49Z"
    },
    {
      "id": "fca42905-2d5d-4421-a8a0-dc5964a2ffef",
      "title": "The Science of the Modern Base Season: Why Zone 2 Isn’t Enough Anymore",
      "summary": "The Science of the Modern Base Season: Why Zone 2 Isn’t Enough Anymore Outside Magazine",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNbjd1b0IxUzBHTXRtWV83QTd2RmViQXE3Y19iZlZOODdTeWp4amNtT1NIYmUzaDAwSUlNLWdkMXh5amxWMjI3bVF4MjRuU2JJYXNVenp6VEx6ZER1ekZiS1MtNkVQWVRaRXROd0dZWDJEeEVhdENhMG1BNGtWcWhIOXB6Si1IZmhyRHhsc0lHREFKWENhYVRqU3o5bFhhM0ZuSmdDendpQWZDa0RrN0FaS0h2dWtpblpnOG1v?oc=5",
      "source_name": "Outside Magazine",
      "date": "2026-02-01T17:10:28Z"
    },
    {
      "id": "999d22f0-c9d3-48d4-af29-5ca9c6edcadb",
      "title": "Pokémon GO Events This Week: February 2 to February 8, 2026",
      "summary": "Pokémon GO Events This Week: February 2 to February 8, 2026 Pokémon GO Hub Pokémon GO February 2026 Community Day Features Vulpix and Alolan Vulpix Pokemon.com Pokémon GO February 2026 Community Day Guide Nintendo Wire Pokémon Go Vulpix Community Day Eurogamer Pokemon Go January 2026 Events: Raid Bosses, Spotlight Hours, Community Day, And More GameSpot",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQeWxsSy1hUzhGcW9NZUJqYlBNX3lVckprdHV3UU8yVElXc2NySnp5d0dOejRVQ3k3dVVreVItTG1hcDZKeDk0cUZNVlQ5clR3RGZGblcxek1BNGNROG5IS1dlQ3JQNTBIMGQ4LVRibTVSVmF6SG1FVlgwbng1UVAtd3ZJZ00zSWlULVhaZzB2UWxXN0R5dlFJZHp3?oc=5",
      "source_name": "Pokémon GO Hub",
      "date": "2026-02-01T17:39:02Z"
    },
    {
      "id": "13fecafd-2b5b-4d00-930f-60780411b1e5",
      "title": "Escape from Tarkov ducks for its first major crossover event",
      "summary": "Escape from Tarkov ducks for its first major crossover event Eurogamer Steam hit Escape From Duckov gets official crossover with Escape From Tarkov, bringing the two extraction shooter giants together GamesRadar+ Nvidia’s Next Bottleneck: HBM4 Memory Ramps as China Access for H200 Stays Uncertain FilmoGaz Escape from Tarkov Crossover Teased with New Promo Code Insider Gaming A new Escape From Tarkov collab with the 'rival' that stole its Steam launch thunder adds one of Arc Raiders' best bits PCGamesN",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQUGpjb1NaNFlPc3AxUDBTR1diLUtIbl96Uk81eTVuQnFzaGdlWUdFUl84bWdyMHByMFZPZEhJT19ENlRWcERPaDl6cThZRnBVOGZYNjJLdFFqU1RVSlBnTU56RkFsdXpmVHBMekpBa2FSQkg4RE5VejlEamk1dm9qT2Nsdm56Z2pEQjluakZkUQ?oc=5",
      "source_name": "Eurogamer",
      "date": "2026-02-01T17:56:24Z"
    },
    {
      "id": "446cf3b9-9b96-496a-949a-5a6754f8dd05",
      "title": "What to expect from Samsung Unpacked 2026: 5 biggest rumors on Galaxy S26 Ultra, Buds 4 Pro, more",
      "summary": "What to expect from Samsung Unpacked 2026: 5 biggest rumors on Galaxy S26 Ultra, Buds 4 Pro, more ZDNET Samsung Galaxy S26 Ultra Release Date: New Leaks, Disappointing News Forbes Samsung Galaxy Unpacked 2026: The Galaxy S26 lineup and everything else we expect Engadget Exclusive: First look at Samsung’s 25W wireless charger, possibly for Galaxy S26 SamMobile Samsung Galaxy S26 Ultra: The ‘No More Excuses’ Flagship Geeky Gadgets",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQMVRHbGp3Mld1RDVnemFWeUlPdzd3b2VicW9jTkgwek94UDI0X19Mb0J2bXdQTmhENTlpekxUR3ZTSEFCVjJrZmYzZ0tYVllVdWFkSUNTLVBZLVBsaHlpRFVEdGYwOEYxOG4ycFhSOXRfUWh6Y1FXNG9uZm51ZGVMYk5Rb0tDWThpZ3FxQw?oc=5",
      "source_name": "ZDNET",
      "date": "2026-02-01T11:00:00Z"
    },
    {
      "id": "ac82416b-7649-40ca-95b3-ad0a0c3168a4",
      "title": "Wait, Google Project Genie can generate playable Mario and Zelda games?",
      "summary": "Wait, Google Project Genie can generate playable Mario and Zelda games? Creative Bloq Genie 3 Google DeepMind Project Genie: Experimenting with infinite, interactive worlds blog.google Videogame stocks slide on Google's AI model that turns prompts into playable worlds Reuters Google’s AI helped me make bad Nintendo knockoffs The Verge",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOSnVfMmR4QV9ZaXZ3ZWRTcEpNUmN5VEdiLTR5MWowRW5LdmREcmp4azdZeXBrY01mRkRqT19SbXZJMjRhUkFtbUxEYjNaM2FJZEhKZ2pFZTN4bzVWT0RCMW5vcUoxTlk4aldQV2dXMmpjcWE4R21vV0VYZEt0ckFVQTFCZDBueUFNdEhZUDdJLWFlZmlKQVFndU43NGY0b3hkV25qMWRJZnFZTmJrUldsWGZSX1dqM3poVTlTeWM1LVc5MGJsVkE?oc=5",
      "source_name": "Creative Bloq",
      "date": "2026-02-01T08:00:00Z"
    },
    {
      "id": "5f2ec193-0780-468a-8d51-46a687c167b2",
      "title": "This to-do app actually keeps up with my brain",
      "summary": "This to-do app actually keeps up with my brain Android Police",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNQVY1aXVrQ1JxRUYxTjhEMzViQ3pfdE9WNUFLU1ZpeHJmODNGRFh4VjIzNnZJZ000SnNUeVNYeEVBV0dEV2Zud1NOMHctNjcwM0k1T01SZXFQQ1J2T3dXcmUtZnlVOHJJZVhOVVk5QzRWWHAydHJER0ZoRVM1QV8yR3BTMA?oc=5",
      "source_name": "Android Police",
      "date": "2026-02-01T17:15:10Z"
    }
  ]
}