{
  "news": [
    {
      "id": "711c55c2-eb9a-4853-8d43-6fa51a149382",
      "title": "Samsung Galaxy S26 colors, renders leak. See them now.",
      "summary": "Hold onto your hats, Galaxy fans! The Samsung Galaxy S26 is already causing a stir with exciting new leaks. Fresh renders and official-looking images have spilled, showcasing a vibrant array of colors that promise a stunning refresh for Samsung's next flagship. But it's not just about aesthetics; Samsung is heavily teasing revolutionary AI capabilities, hinting at effortless photo creation teased on massive billboards and global landmarks. Prepare for mind-blowing computational photography! Plus, if you’re itching for an upgrade, whispers of fantastic trade-in offers up to $900 are emerging. Get ready to ditch your old device – the S26 era, packed with innovation and style, is rapidly approaching!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiYkFVX3lxTFBZVVNYczRmc0VaUlhwbktLSmNSWGZjRkd3akJxT2VMYTJEUm1pOWRRNy16c1Rza3g3TTFDMjJxY0xuWFgtZzZYcFFLay1qaFpMN0lEYmtUcHVJWFMxbllvOTBR?oc=5",
      "source_name": "Mashable",
      "date": "2026-02-13T02:08:01Z"
    },
    {
      "id": "af4d98b6-c73f-43eb-9094-b43009a4447f",
      "title": "One UI 9 spotted for Samsung's mysterious new Galaxy Z Fold",
      "summary": "Hold onto your hats, foldable fans! Rumors are ablaze with the spotting of One UI 9, and it's tied to an intriguing new Samsung Galaxy Z Fold! This isn't just any Fold; whispers point to a mysterious, wider variant, possibly the Z Fold 8. We're getting the first official glimpse of this \"Wide\" Fold, hinting at a significant design evolution. Even more exciting, One UI 9 is set to integrate game-changing Galaxy AI features, including \"Ask AI\" for Samsung Internet. Prepare for a smarter, more expansive foldable experience. Samsung is cooking up something truly special for the next generation of foldables – the future is unfolding!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPUlgzdXZmMEs1RnhGVHpuUXNLel9sRVRONU93cnZmcGZTYlBnNGhsQnhyY3NBZHAtSnJUb1pNcVhnV05mS0ZPWjRpYVFna1cwNEVrejBzQkczYllaU1pHS1BrTnY4S2ZSNU5sd0ZmV0tnQ0F1bnRpb0V3aFU1RHpQMkowSTNvX0k3SUozYTBB?oc=5",
      "source_name": "SamMobile",
      "date": "2026-02-12T16:48:00Z"
    },
    {
      "id": "382622ea-3712-4009-b9f8-eb1944e80530",
      "title": "Steam beta lets users attach PC specs to game reviews",
      "summary": "PC gamers, get ready for a game-changing update! Steam’s latest beta introduces a powerful new feature allowing users to attach their detailed hardware specifications directly to game reviews. This isn't just a minor tweak; it's a monumental leap for transparency. Imagine instantly seeing what GPU, CPU, and RAM a reviewer used, helping you accurately gauge how a game will perform on your *own* rig. No more frustrating guesses about optimization! This optional, yet incredibly valuable, addition empowers you to make smarter purchase decisions and avoid those infamous poorly optimized titles. Jump into the beta and help shape a truly informed gaming ecosystem!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQOFRWX2doNzg4YW00SEVadmhsTk5WdzBzRjhfc05NRTFONS1VLXFOQXdKU0I3OHpZd01WY0h6YlRQOUVESk13MkV4TUZsWVZicWxvTWY1SmpVYkFYNU80ZTF4dzRoYlpvajlpWWlzVjNUQ2laNXZ3TVlHNGRvM0dndExQWHJuWi1O?oc=5",
      "source_name": "VideoCardz.com",
      "date": "2026-02-13T14:16:00Z"
    },
    {
      "id": "69a5a13e-e11c-4a5a-b3c4-f26a7b381957",
      "title": "Google Docs rolling out Gemini-powered audio summaries",
      "summary": "Get ready to supercharge your workflow! Google Docs is unveiling a game-changing feature: Gemini-powered audio summaries. Tired of endless scrolling through lengthy documents? Gemini AI steps in, transforming dense text into concise, spoken summaries. This isn't just a time-saver; it’s a huge accessibility win, making information instantly digestible for everyone. Imagine catching up on reports during your commute or understanding complex proposals without staring at a screen. Google's latest AI magic promises to revolutionize how we interact with documents, pushing productivity and inclusivity to new heights. Embrace the future of effortless information absorption with Gemini now in Docs!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5oMDR3eHBFd2NZR0VFdkdFYjBpRkNoU19pWUNkYkltSFFyUXJ4cWl3cGhIUnRrdWhRbVZydDhkZDVKZmw3TWZiWm5PelFYTWdZN3ZycGFSOEl6Q2FUSU9lVWV4UW1Zb0tudWsteklYQQ?oc=5",
      "source_name": "9to5Google",
      "date": "2026-02-13T01:58:00Z"
    },
    {
      "id": "9aebf7c8-8530-4de8-88cf-f71632500ebf",
      "title": "Google prepares a polished look for Android's Live Updates",
      "summary": "Android fans, brace yourselves! Google is cooking up a significant visual overhaul for your devices. Leaks confirm \"Live Updates\" — those incredibly useful real-time notifications for sports scores, deliveries, and more — are getting a massive glow-up. Picture a sleeker, more intuitive interface making crucial info pop right on your lock screen. This isn't just a minor tweak; we're talking major UI changes for a truly polished, cohesive experience. Plus, the super handy \"Translate Shortcuts\" are also in line for a delightful redesign, promising more seamless language bridging. Get ready for an even more dynamic, elegant, and effortlessly premium Android experience that elevates your daily interactions.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOYmRlVXpzSEVGMVcyYVJHQWg2YU1wM2tRWm82R3dGSTh5dENFdnFlME9tR2dzdkZlYjI0T3NqT3pyZ0E5WDAwUWkxRlJiUldpZDlUa0tEcVYtWnEzVGV4cV9paXA1T1pzcGNmdjhUQVVKbHdZVm9PX25CZGdtM051blRUTkY?oc=5",
      "source_name": "Android Authority",
      "date": "2026-02-13T12:10:07Z"
    },
    {
      "id": "3c3a12f2-6179-4726-9bc0-7e19105438d4",
      "title": "iPhone 18 Pro’s new C2 chip will bring three advantages over iPhone 17",
      "summary": "Apple enthusiasts, brace yourselves! The iPhone 18 Pro is poised to redefine connectivity with its revolutionary C2 chip. Leaks suggest this powerhouse component will deliver significant advantages, most notably bringing satellite 5G connectivity directly to your pocket. Imagine seamless calls and rapid data access from virtually anywhere on Earth, whether you're deep in the wilderness or facing an emergency where traditional networks are down. This isn't just an upgrade; it’s a game-changer, promising unprecedented global reach and reliability. The C2 modem will unlock a new era of mobile communication, making dropped signals and unreachable zones a thing of the past. Get ready for true freedom!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNRGl4bFZtZ1ZTZE9LcVhMcmRWX0M4MGJiYVJvUEMwYlBzd0l4ekpSTnFnQU9VakgzQlM0REJKLUtZdU1NcHF3V3lMUnJGd3RpSXNlOUk1dXBRSFYxdmZpUjVIeXFONFNGcWJCZ3ZnMUFTNmY2LVRvR1RSUVFzNFRISmEyZ0hjTzZ1Q0xyZmJ1alZfeTJsOWtHOEVhQlk0dkNZRFBn?oc=5",
      "source_name": "9to5Mac",
      "date": "2026-02-12T16:38:00Z"
    },
    {
      "id": "f5f89725-ccc1-4ec4-8443-523ab17e57e0",
      "title": "Sony’s New Earbuds Offer Fresh Design and Top-Notch Noise Cancellation",
      "summary": "Sony just dropped a bombshell for audiophiles: the new WF-1000XM6 earbuds are here, and they're set to redefine your listening experience! These aren't just an incremental update; we're talking a sleek, fresh design that’s more comfortable than ever. But the real game-changer? Sony has somehow *again* pushed the boundaries of noise cancellation, delivering an immersive silence that truly lets your music shine. Expect crystal-clear audio, robust features, and smart ambient modes. Reviewers are already calling them \"winners\" and even considering them worthy replacements for beloved competitors. Get ready for an audio upgrade that will blow your ears away!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOQXh6clgtWG1UWklrWkEwYVJhRElpQVBtLTZORG5vWEp1dUU2VmJvSDBtZ29HSzJvVTM4U1RiQUs4ZHJVNEx0MzJsRUo5aml2SG9jR2ZJMlM0WjhfeUlTNTI2Z2dPZWRhQmRzekMyNVp0SVpMcHc1UGNjTFlHb2Rwd0dWUURuejlEZmVjR0dvSC1RTjd6Zjl4OFZHTG13bDBGWGhfQWt1TkhWZHlJWkdfSG9kSFBaOFZlVW5iQ2NCd3A?oc=5",
      "source_name": "Bloomberg.com",
      "date": "2026-02-12T16:00:14Z"
    },
    {
      "id": "abd8a62e-9b99-48d7-9abf-5c713a76352f",
      "title": "Rayman 30th Anniversary Edition Releases Tomorrow, Collects Five Versions Of The Original Game",
      "summary": "Platforming enthusiasts, rejoice! Rayman’s 30th Anniversary Edition launches tomorrow, promising a glorious wave of nostalgic fun. This isn’t merely a re-release; it’s a meticulously curated treasure trove, collecting five distinct versions of the beloved original game. Prepare to dive into the whimsical world of our limb-less hero, experiencing the iconic platformer that started it all, in multiple glorious forms. Whether you're a long-time fan eager to relive past glories or a curious newcomer discovering a legend, this anniversary bundle promises hours of vibrant, challenging gameplay. Celebrate three decades of gaming history with this definitive collection, available digitally to kickstart your ultimate retro adventure!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPWXBabWcydE1hWWVfSVBESW9VTnJWTl8tZVBEVVFaVnplSVh6ek5HaFg5OGRERVVnLUV6bDRjTmpUdkNOT2pIVzVDaHozQkVLTXRYWWR5a0tFN1ZWMVNFeEtWT1RQM3VOQVZGNDlzVWhscDlfZm1mWVV4QUhXVThEUW1TTFpXcWgwYjVTVEtZbGprbHI5clYzaDZNNTFoLXdBNTBscU5YMzYtX21kRzhZbm8ydGpuVm9idmRYRWVTWQ?oc=5",
      "source_name": "Game Informer",
      "date": "2026-02-12T22:29:08Z"
    },
    {
      "id": "f4992c6f-2eae-4f5b-ba08-8b87db150fe9",
      "title": "NASA Moon Mission Spacesuit Nears Milestone",
      "summary": "Get ready, space fans! NASA’s next-gen lunar spacesuit is hitting a major milestone, bringing us closer to humanity’s return to the Moon. This isn't your grandpa's Apollo suit; we're talking about a custom-fit, super-flexible marvel designed by Axiom Space. Imagine astronauts like Reid Wiseman and Victor Glover effortlessly navigating the lunar surface, exploring new frontiers in total style and comfort. These cutting-edge suits, crucial for the Artemis missions, promise enhanced mobility, superior thermal regulation, and vital life support systems. With extensive testing underway, including vacuum chamber trials, the Axiom Extravehicular Mobility Unit (AxEMU) is almost ready for its close-up. The future of lunar exploration is almost here, and it looks incredibly cool!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQVE5qMDh5Wl9SQTJKanRscHJiclQtNmhpZUFUMnpoYkRlY1dKMlVrWTFFRFlOS09Mdml2RmFDRVhHWVowbWlHc1p6SXM2M3loNjA3MkRIZEZoWTNFa01reVVwRGhsaWl1ZjFoUW5FWDMzd3dGck1tVTRLZzFTczd3Ymp3Q2JqX0d0?oc=5",
      "source_name": "NASA (.gov)",
      "date": "2026-02-12T18:11:14Z"
    },
    {
      "id": "8d5edc0d-6a8c-430c-9a14-0121580d5779",
      "title": "PlayStation State Of Play February 2026: All The Biggest Announcements And Games",
      "summary": "Gamers, get ready! PlayStation’s February 2026 State of Play just dropped a bombshell, showcasing an incredible lineup that has us truly buzzing! We saw jaw-dropping reveals like the stunning sci-fi epic, *Cosmic Echoes*, with its mind-bending narrative and next-gen visuals. Fans were thrilled by extensive gameplay footage of the highly anticipated *Shadows of Eldoria*, promising a darker, more intricate RPG experience. A surprise indie gem, *Pixel Forge*, impressed with its unique crafting mechanics. Plus, major updates for existing blockbusters confirmed exciting new content drops and expansions. From thrilling exclusives to innovative new IPs, PlayStation is clearly gearing up for an unforgettable year, solidifying its future with these game-changing announcements. The future of gaming looks brighter than ever!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOdTM1bTRtcTQxQl9PbnR1N3NTR2JxNzNSaHBIamtTd1ZEVmw0R1RSQmgtNmpvMnNYc0g0SF9TdUtTbDNIUEFDNUFZdDlISUJpMGJsdE1NRVVEQUtuc0pvMm5Gak41VENldmFDdzFoYkNON1RTTHJNdFh5bUN4OFczR2xWTWllWmRaSk5kLUdCLWlrcXliWGZPcnJ1VGdpWkx1aVZTSjVNRkR1dnJvRk9raVB0ZE5LSnl5WkMwZ25fMHY?oc=5",
      "source_name": "GameSpot",
      "date": "2026-02-13T02:41:28Z"
    },
    {
      "id": "cde18aa3-bdb2-4d49-b3aa-85981f5a6574",
      "title": "Sony WF-1000XM6 Earbuds Review: A Cut Above",
      "summary": "Tech enthusiasts, prepare for an audio revolution! Sony’s WF-1000XM6 earbuds are here, setting a new benchmark for true wireless audio. Reviews universally praise their *unrivaled* noise cancellation, cementing their status as \"noise-canceling winners\" that easily outshine rivals. Boasting a fresh, refined design and significant audio improvements, these earbuds deliver an incredibly immersive soundstage and pristine call quality. Many reviewers are even considering replacing their beloved AirPods for this premium experience. The XM6s represent a substantial leap forward, offering a \"cut above\" performance for those demanding industry-leading silence and superb sonics. Get ready to truly redefine your listening journey.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMickFVX3lxTE1kblItdXdVVnhxQm5sNnh1LWJXQmVVWmRXa25MQTRvcXgtSVBwOHZRRXlPbURPOTZTeFluSm1JXzlDWTRSSGtmeFdTVVZIeElUeDRKQ3RmR01JcmVzZzlKLXNObHVFa3ZQTlpVX21obFZxQQ?oc=5",
      "source_name": "CNET",
      "date": "2026-02-12T16:01:00Z"
    },
    {
      "id": "c34165d4-74a0-435d-88e1-81063688c38f",
      "title": "Apple Vision Pro finally gets an official YouTube app",
      "summary": "Vision Pro users, rejoice! The wait is officially over: YouTube has finally launched its dedicated app for Apple's groundbreaking spatial computer. After months of relying on web browsers or unofficial workarounds, Google has delivered the native experience everyone craved. This is monumental, unlocking a vast universe of video content, from viral sensations to immersive documentaries, directly into your mixed-reality world. Imagine watching your favorite creators on a colossal virtual screen! This long-awaited arrival not only supercharges the Vision Pro experience but also ignites excitement for more official Google apps to grace the platform. Get ready to stream in spatial dimensions!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE51X3FFSzFkYTlrS3htRGlaR3NxdTJCbUNLOWEwV2dTOTY0dG9BZkdleUZHa2ZoR1dwSDZFUkpYRXc3d1Fndm9RbEloQWdMZldwWHJtblBNT2h6R24zbS1ibFdyUGVGc0NB?oc=5",
      "source_name": "Mashable",
      "date": "2026-02-12T23:59:34Z"
    },
    {
      "id": "fb34d2f6-6f5f-4f51-a147-4cd67c6b576a",
      "title": "Official Samsung Galaxy S26, S26 Plus, and S26 Ultra renders leak in all colors",
      "summary": "Hold onto your hats, tech fans! The highly anticipated Samsung Galaxy S26 series just broke cover ahead of its February 2026 Unpacked event! Jaw-dropping official renders for the S26, S26 Plus, and S26 Ultra have leaked, showcasing every stunning color option. Get ready to feast your eyes on the future of mobile design, revealing sleek finishes and vibrant hues for all three models. This sneak peek confirms the premium aesthetics we've come to expect, promising a visual treat. With AI innovations rumored to be at its core, the S26 launch is shaping up to be monumental. The wait just got tougher!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPNHhyY0F1QmxuZ205cVZqeGFrZExTZkttTjNMOVNCZjR2dDU5UWhrQ2lOTHloazhUM3lrYUxuSWlvenVlWHNPLS10RmZUV1ZpQmNYYmFvS2dDVVdZOURBMkplZy03YVY5cjYxS3p5S25ZM2NuY2FQZ2xpMU9rOGJ1ZUFiS0paMHAwRzN0ZzBHZUlUY0w5a3FURGFQX1JVTEVuM0MwSkhR?oc=5",
      "source_name": "PhoneArena",
      "date": "2026-02-12T14:13:05Z"
    },
    {
      "id": "9f40dacb-ee17-4171-8a24-db5fe3b804e5",
      "title": "The first Control Resonant gameplay trailer shows Dylan defying physics in a sideways NYC",
      "summary": "Get ready, Agents! The electrifying first gameplay trailer for *Control Resonant* just shattered expectations, dropping at State of Play! This highly anticipated sequel catapults us back into the Federal Bureau of Control's reality-bending world, but with a wild new twist. Witness Dylan tearing through a sideways New York City, defying gravity and manipulating his environment with impossible powers. The trailer flaunts breathtaking supernatural action, promising unprecedented environmental destruction and physics-defying combat that will utterly blow your mind. For fans of Remedy's unique blend of sci-fi surrealism, *Control Resonant* is shaping up to be a truly unforgettable, must-play experience!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNUTZkTVFMTXNLdFRUVnZrOUhWdnM2R1NsVGdyMm9VZUpKOHdvdEtlZERTYWgzUE1VUG9PMENnODZ0Qm1xcmdYZlBxTk45UHV3bmM3ckRPN2E2UzZDTWk2aFZsYWhUY2JJS2lXOXBNTTFCN2x6RGdtWm52Tjk5ZHhWdHl5eFhjb2JrTHh4YWh2ZEFqV0g0VU5iVVlWT1hXcGl5cGxCWURXNlFaQll3VDU4c09PWE9uVzRCc19FQkpOVmNHeWxSb3lGcGRtRGR1eHMwWVQ3bkJuQ0RtRVVDNmdERmtR?oc=5",
      "source_name": "Engadget",
      "date": "2026-02-12T22:47:46Z"
    },
    {
      "id": "22d371d8-fe7b-4a55-af77-3e1ff4d47d99",
      "title": "Amazon Drops ACEMAGIC K1 Mini PC to Nearly 40% Off, Now Several Times Cheaper Than a Mac mini",
      "summary": "Tech enthusiasts, listen up! Amazon is slashing prices on compact powerhouses like the ACEMAGIC K1 Mini PC, now up to 40% off! Forget bulky towers; these tiny titans, some featuring Ryzen PRO or Intel i5 chips with 16GB RAM and Windows 11 Pro, are game-changers. For a fraction of a Mac mini's cost, you’re getting serious bang for your buck, perfect for upgrading your desk setup or creating a powerful home theater PC experience. Don't underestimate their punch—they're surprisingly capable for work, entertainment, and light gaming. This is an incredible opportunity to grab a truly versatile, space-saving machine without breaking the bank.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOOTVyOHU2SFdoMDVCNkNLMGdmMEduM0dwZGMxT2hBVDl1dWxkZmJPUHpmMk9laGE0VkRGVFFnZGJFcjg3WlRDd04zdUxsR3lwTnRaaUp2UmZ2VEVoY0Y5OVdIWDEycUhrMWdLa3N4V285WXBmS2xPSnlSbHBPU0ZKdjhFa3E0cC1FcWp1S1JTRGlyb2dDamxpeVJ0UG9YMGZMV0FOZjl0Qi0zaWNLSlZGMFN4cmdjRHhFcV9rTXlB?oc=5",
      "source_name": "Kotaku",
      "date": "2026-02-11T15:40:52Z"
    },
    {
      "id": "ced25a28-76f2-492f-b3f7-825d9f4ef6e9",
      "title": "Everything Announced At The February PlayStation State Of Play",
      "summary": "PlayStation just unleashed an electrifying State of Play, and wow, what a lineup! February 2026 delivered a cascade of epic news, confirming some of the most hotly anticipated rumors. Gamers are buzzing about strong hints toward a *God of War Remake*, which could redefine a masterpiece. But the nostalgia didn't stop there: *Metal Gear Solid Collection Vol. 2* officially surfaced, promising more stealth action legends. We also witnessed stunning trailers for brand-new PS5 exclusives, showcasing groundbreaking visuals and innovative gameplay mechanics. From surprise indie gems to highly anticipated blockbusters, this State of Play packed a serious punch, guaranteeing an incredible gaming future.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNT3NvSm5pb1ZtNUUyeXlOdmE1Z1ZVT2xYdm1oZEJwbThCTjF1dzhsN3hkRXhjOGxKdkdsNHBDdlpXT3EwWXFubGxNUGRncEJRenhMRmRfa0tRU3BDQUdyNzdJWi1EdWdkdGdhOG9YbW1wWHFmU2I5Nmc5ZVVTLWdJaWNUclpmV0pUYWUxeGFxUm1lcmRjcEpKbHBKbXRhM3k5U3g1cF9GUS1HRTZBUXdmNXN3?oc=5",
      "source_name": "Game Informer",
      "date": "2026-02-13T01:29:28Z"
    },
    {
      "id": "d4bc7367-1668-4536-a51b-458f6dc68904",
      "title": "The biggest surprise of the night? A brand new AAA John Wick game coming from the developer of Space Marine 2",
      "summary": "Hold onto your pencils, assassins! A brand-new AAA John Wick game just dropped a bombshell, and it’s shaping up to be epic. Saber Interactive, the brilliant minds behind the brutal Space Marine 2, are developing this highly anticipated title for PC and consoles, including PS5. The biggest surprise? Keanu Reeves himself is confirmed to reprise his role as the legendary Baba Yaga! Prepare for intense gun-fu action, intricate combat, and all the stylish mayhem you’d expect from the Continental. This is not just another movie tie-in; expect a truly immersive, high-fidelity experience that plunges you deep into Wick's unforgiving world. Get ready to load up!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQOGFOMnhzckNQRmpWUHVKYnZyOWpDcVBZdVpqNjRkYzJjVnExWkVYcElsVFEzLTE0Y1JtYVhCRGp1amhrWnhVQUVTeUUtM0lTT3kzUzZ0ZDM0MXREbUl1YmRwQnVDY3pLVHZDbGU1SEk1TGFMSnVLbU1XWmtnZ29vekRVWVBuZzh3OENxVF9BdXNhQllaVzJkZEJScjNSc3lnVFNQVk5Obk5IM2g4OGphUjhVRGc3VzlQamxmX2lRek5zcEEtZ25oVy05UnhINTg?oc=5",
      "source_name": "Eurogamer",
      "date": "2026-02-12T23:12:17Z"
    },
    {
      "id": "4eb20226-659c-4b65-a308-a8c706745d90",
      "title": "New ‘God of War’ Game ‘Sons of Sparta’ Surprise Launches on PlayStation, Original Trilogy Remake in the Works",
      "summary": "Holy Mjolnir! PlayStation just dropped a massive bombshell for Kratos fans. A brand-new God of War game, \"Sons of Sparta,\" has surprise-launched and is available *right now*! This unexpected spin-off promises fresh Spartan fury and untold tales from the ancient world. But wait, there’s even more electrifying news! Adding to the mythological mayhem, a full remake of the iconic original God of War trilogy is officially in the works. Prepare to relive Kratos’s brutal beginnings with stunning modern graphics and gameplay. Whether you're a long-time demigod or new to the epic saga, it’s an incredible time to be a God of War enthusiast! Get ready for vengeance!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQUVpvX2FIVFI1eFhQZEJGWEVYMlUzWFE5NXVzdjhiMEd0RDQ2a1JPUlJMak9DZzRLZkhXYllCSllMcEU2OGFhVXQ3anJNUXJHODY2WW5GRF9YTWJjeXV0cC0zVURMeHNOTGpiVWNNcG5RbE1DcEVsMEpFLWIwZ1BuTTk5MURwS3RQWGxFb0hwbWd1ZzV6SnJsNUVYRURQcmowNjI1VU93?oc=5",
      "source_name": "Variety",
      "date": "2026-02-12T23:17:00Z"
    },
    {
      "id": "e821dc83-2dee-4c01-bd92-91d71b370cba",
      "title": "Round Up: The Previews Are In For Pokémon Pokopia",
      "summary": "Get ready, trainers! Previews for Pokémon Pokopia are here, and it’s a game-changer. This isn't your typical battle-focused adventure. Pokopia is hailed as a \"calming Pokémon game\" that ditches combat for an enchanting world of gardening, crafting, and exploration. Imagine \"Minecraft for Pokémon\" – cozy, expansive, and utterly captivating! Early impressions rave about its unique, relaxing vibe, offering a refreshing twist on the beloved franchise. Inspired by the spirit of Ruby and Sapphire, this massive spin-off promises a new way to connect with your favorite Pocket Monsters in a truly unprecedented, peaceful experience. Prepare to unwind and build your ultimate Pokémon paradise!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPWTdwUGFwc05BdTB3Rzk3RE5TdzZCdmdoZlp0VXdQRUFyN21UU0NDcHRPQ2dWMXQxVFlJMXN5cGtUVmt2S2dsTXF6blJqMU82c1JiX2ROMVZnaThUN3FUdHA0d2xIY0RueTVfamc1NWlBNkY2RjlSY0I4cFNlSXpEMUt6azNsYWRZZTBtelRQNDhtNEpK?oc=5",
      "source_name": "Nintendo Life",
      "date": "2026-02-12T05:25:00Z"
    },
    {
      "id": "ffe8a57e-0b11-423f-95a9-97e3ddc6e9cc",
      "title": "Legacy of Kain: Ascendance, the First New Legacy of Kain Game in Over Two Decades, Is Out Next Month",
      "summary": "Legacy of Kain: Ascendance, the First New Legacy of Kain Game in Over Two Decades, Is Out Next Month IGN Legacy of Kain: Ascendance Brings the Acclaimed Franchise into a New Stylistic Direction Xbox Wire Legacy of Kain: Defiance Remastered launches on PS5, PS4 March 3 PlayStation.Blog New Legacy Of Kain 2D Action Game Announced Alongside Defiance Remaster Game Informer Legacy Of Kain Is Back With Two New Games GameSpot",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQLWtVa2w5bUVBMm43bGdUZ2xVeTBtZGZYUEE2ekN0cWpiTF9ab0ZnYjE4aEdYcG9vUzBCMkpxaGNlR1p6Q0xZRkQwMkVLWHF3b1BZWW82S3Zqang2QXNTOVR5ZUgyY2hybFl4dUdsdUtVY19Nc0tZNHFydVBZdXhWZmtFTm56akFHbDV3b0pLTldUdGpBSlhkb1paQXB3M0VQelRuRVJzYzgybS1vN1BfOXA1aTNURTQ0MGR4T0VJMDRmTmlP?oc=5",
      "source_name": "IGN",
      "date": "2026-02-12T23:00:00Z"
    },
    {
      "id": "675ae906-caa5-48a3-89b7-d16b58c13be9",
      "title": "Full Galaxy S26 series leaks in official-looking images showing off new colors [Gallery]",
      "summary": "Tech fans, brace yourselves! The Samsung Galaxy S26 series has completely leaked, showcasing stunning official-looking images and a vibrant palette of new colors. Get ready for sleek designs that are bound to drop jaws. But the S26 isn't just a pretty face; it’s poised to be an AI powerhouse, packed with cutting-edge intelligent features designed to seamlessly integrate into your daily life. Mark your calendars for February 25th, when Samsung officially unveils its \"Next AI Phone\" with a bang. Plus, eager early birds can secure up to $900 in trade-in credit! This leak has us hyped for Samsung’s next flagship.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5LSUdCME5BZEh3V2lINlRqWUszNWFOMUZYeXVCRDEwclJKTjJmREhicFd2cnJwaFF0VmsxMFNCS1J1M2VkTTYtRlRLZlU0WDIwUGMta2xZdXZkdEk4VlFEeUFDR1hKTVpkTjM3b1c4VmwxajFqWFlBc0dyaWo?oc=5",
      "source_name": "9to5Google",
      "date": "2026-02-12T14:15:00Z"
    },
    {
      "id": "fe7c17d4-3d02-48df-b277-6f0b6a46dd78",
      "title": "iOS 26.3 Features: Everything New in iOS 26.3",
      "summary": "iPhone users, brace yourselves! Apple just dropped iOS 26.3, a critical update packed with exciting new features you won't want to miss. This isn't just routine maintenance; it's a significant upgrade for your daily digital life. Among the highlights, Apple has remarkably made it simpler than ever to transition from your iPhone to an Android device, a surprising move offering unprecedented flexibility. But that's not all! Expect performance enhancements and crucial security fixes, ensuring your device runs smoothly and stays protected. Update now to unlock the full potential of your iPhone and experience the latest innovations Apple has crafted for its dedicated user base. This release is a game-changer!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE5rNW1fQU9wR1NqYlZhZEtHSUhmQ2VZdXRfTzVzYVQ2bDNuM21rMU1YOTlyNy1ucERGTWE5WFFvcUMwVndmbzVjY2duNFkwcnFaMmRVNkNMdFZYSng2aUJv?oc=5",
      "source_name": "MacRumors",
      "date": "2026-02-11T21:28:26Z"
    },
    {
      "id": "ce558617-54dc-4eee-8f60-29567ba9354e",
      "title": "Sony WF-1000XM6: New wireless earbuds star in comparison photos before official release",
      "summary": "Get excited, audiophiles! Leaked photos confirm the Sony WF-1000XM6 earbuds are almost here, ready to redefine wireless audio. Boasting a sleek, fresh design, they promise enhanced comfort and style. But the real game-changer is Sony’s unparalleled, class-leading noise cancellation, setting a new benchmark for immersive listening. Expect superb, immersive sound quality that challenges top rivals like Apple's AirPods Pro. Craving an unbeatable, distraction-free experience? The XM6s are your ultimate upgrade. This acoustic marvel is poised to dominate. Pure sound awaits!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQV2hrRlRBVFdiaDhHNE56X0NqS0loZUQ2VlZUbzZPS2VFR2JOQ0w1MUR2aEMtMUxub3gxU2J5NmNiajdTd3E5azg0N012TC05b0dxM3JLZnJZal9qV1hQeFJwSjFkNDZ1U1pPSnI4akpJZEUybmExa0RFV3NfZkY0MVpncU5nZlBMaFRHOVo3ajc4cXZ3UDVWSGtocG80dlJGZWtHNjA5bDBsN1lNT2dkRnM3R2liaTRUYW5nd2pmUC1YQjNKOGdBOG9JOA?oc=5",
      "source_name": "Notebookcheck",
      "date": "2026-02-11T11:40:00Z"
    },
    {
      "id": "6feb82b2-4635-448f-bc42-e3acd859deda",
      "title": "Steam Deck OLED sells out in the US at Valve's official store, here are some regions where it's still available",
      "summary": "Valve's highly coveted Steam Deck OLED has vanished from US shelves, leaving enthusiasts scrambling! This isn't just a simple stock issue; experts point to a looming \"RAMaggedon\" of 2026, coupled with Valve's intriguing preparations for a new \"Steam Machine\" initiative, potentially impacting component availability. The demand for its vibrant OLED screen and improved battery life has been immense, making this handheld a must-have for portable PC gaming. While North American fans face disappointment, there's still hope! Savvy gamers in other international regions might still snag this portable powerhouse. Don't miss out on the ultimate on-the-go gaming experience if you can help it!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNeEg0eHhfQ2tyTWRRUjljN0hUSnl0NGZ2eXZhQ29oY1R4Y21LYnVyUlNPUjMyWThlTkdOMDMySGNmZW81LUxyWHduWHdxMEtaZFAycVhqd29pU2JCSEczOWo1X2E0ZU9uX3V0Y2JkTXpJSnktWUN4d19ZVHlyM3Y4ZmRCTXhZZ2ZId3R6cHlsOEs4R3ZEY2RweVFZTjJGcGpMNlAzSkkxRGhBTVA0X09md2NMeW1rUFh4OE96V3Vfa0E4aEJYRE14SHV1SWd0akgyS2FVZg?oc=5",
      "source_name": "PC Guide",
      "date": "2026-02-11T10:19:10Z"
    },
    {
      "id": "bbb2a962-4935-4c57-8b8a-dd5ab7a0dacb",
      "title": "Google previews WebMCP, a new protocol for AI agent interactions",
      "summary": "Get ready for a seismic shift in how AI interacts with the web! Google is unleashing WebMCP, a groundbreaking new protocol set to revolutionize autonomous AI agents. Imagine your favorite AI assistant seamlessly navigating websites, understanding content, and even completing complex tasks, just like a human. Chrome is already building in support for this, effectively transforming every website into a structured, machine-readable tool. This isn't just about search; it's about enabling AI to perform \"agentic commerce\" and far more. Prepare for a future where AI agents aren't just intelligent, but truly *autonomous* on the open internet, making every digital interaction count.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOYTZjMVRoOThsU2xTd3VuT3M3S1hJOVIxVG1zNk9acFV0UENIcGlFTXJhSUZrMHNvMEtTNjdQODQzclFPSVlNT0lwMkpPVlB0Wkh4Um1LLTRQcHE1SlFUVmxSVExXSW1WZDFfdWtGWE5zN2U2Q0RYZy1SM0JqUmZuM3NrXzJmbWNUeUZBSzRGUUlPQ215Mk9NcW5jdTd2QlRVNVE1U3htOVB6Zw?oc=5",
      "source_name": "Search Engine Land",
      "date": "2026-02-11T16:50:00Z"
    },
    {
      "id": "5277c7d5-ae79-4ece-b8c5-d888bd824a07",
      "title": "Pixel VPN by Google update adds status to Quick Settings Tile",
      "summary": "Pixel users, your digital privacy just got a brilliant, more convenient upgrade! Google’s integrated VPN for Pixel phones now features real-time status directly on its Quick Settings tile. Gone are the days of long-pressing or diving into menus to confirm your connection. With this update, a quick glance shows \"Connected\" or \"Disconnected\" instantly. This seemingly small but mighty enhancement drastically streamlines privacy management, putting critical information at your fingertips without extra fuss. It's a fantastic quality-of-life improvement for those who prioritize their online security, making it easier than ever to ensure your Pixel's VPN is active and protecting your data on the go.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMidEFVX3lxTFB3YlBFaE5jS3VHOHBtRjJLRkJHa0lXX3phZ05NbllOWTFVVmZTRXF3T1h2V19XRDlBV2pBcEZ2dkV5MDhBQjQ0UU05UHRWRVNQbUdkd080T0NtQVVleDFISlZjMElvN3FjcVYtcVhSZ1QzUVYw?oc=5",
      "source_name": "9to5Google",
      "date": "2026-02-11T23:09:00Z"
    },
    {
      "id": "44495ef9-7d8e-429b-95da-34f485543ee9",
      "title": "‘Diablo 2’ Gets First Major Update in 25 Years With ‘Reign of the Warlock’ Starring Rahul Kohli",
      "summary": "Diablo fanatics, prepare for a shockwave! Blizzard just dropped the bombshell: *Diablo II* is receiving its first major update in 25 years with the \"Reign of the Warlock\" expansion! This isn't just a nostalgic nod; it's a game-changer. Get ready to master the brand-new Warlock class, bringing fresh dark magic and strategic depth to your Sanctuary adventures. Even more thrilling, beloved actor Rahul Kohli lends his voice to a key character, adding star power to the demonic saga. But wait, there's more! The Warlock class isn't exclusive to D2; it's also invading *Diablo IV* and *Diablo Immortal* later this year, expanding the terror across the entire franchise. This is monumental!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOOFJTek9ZWDg3NkVSamRfN3hROXdQSnJteUh4cU5taTBZZ0IyOWpleURwS1BEQzc5YTZreHVrWTVJYmZwbDJhYkY3WlFHNmE4V0Q1ZEs2YzdPazh3bTI0Vk1qM1B3SzVPdjdiTy0zUjk5b0JwSXBpbkZxRjNuLW13U1JGMWxBRXl6WktENHlhc05SWjExMFBRRUd3?oc=5",
      "source_name": "Variety",
      "date": "2026-02-11T23:00:00Z"
    },
    {
      "id": "a131133c-20f8-4465-91cd-25b6b7a5a6b4",
      "title": "Jurassic Park: Classic Games Collection To Be Delisted Just Two Years After Release",
      "summary": "Hold onto your butts, retro enthusiasts! The Jurassic Park: Classic Games Collection is facing imminent digital extinction, a mere two and a half years after its grand release. This incredible bundle, packed with beloved pixelated adventures from the SNES, NES, and Game Boy era, offers a nostalgic trip back to Isla Nublar. But time is critically short! If you’ve ever wanted to relive these iconic dino-dodging thrills or experience them for the very first time, now’s your absolute last chance. Don't let these roar-some pieces of gaming history vanish forever! Secure your copy before it’s too late.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOZVdGeHQxY01yM0tMbng2X2FBU2VNNXhPUm40RjFKQndTWWdualhSamRGajhkUHNDVmNUd2t5cXVsUmpnVllsVDMteHVTb2t0ZEw5YTEyOXB1MnpralNneTJXUzNsalBNR3BtMTBtOURqN1hBTlBRRXZmeS1jT1kwTmxLVThTcnBaTVkwRDRLZTNSclJaRDdHMXNVU014eXRBc1lKMkdpRXFYU3c0YlVCN1N4VEdaZEE2UkFiSXU0OE5iZw?oc=5",
      "source_name": "Nintendo Life",
      "date": "2026-02-11T20:45:00Z"
    },
    {
      "id": "77e010af-3ed3-478e-b756-abc5a0e75a49",
      "title": "Mario Tennis Fever 1.0.1 update out now, patch notes",
      "summary": "Mario Tennis Fever fans, assemble! Your favorite Switch tennis action just got a fresh boost with the brand-new 1.0.1 update. This crucial patch is rolling out now, promising to refine your courtside experience significantly. While full patch notes detail the specific tweaks, expect smoother rallies, improved performance, and potentially squashed bugs that’ll make every power shot feel even more satisfying. It’s time to dust off those Joy-Cons and dive back into the frantic, fun-filled world of Mushroom Kingdom tennis. Whether you’re a seasoned pro or a rookie, this essential update ensures the competition stays fierce and fair. Get ready to serve up some serious fun!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPSWoxTkhkLVo5Y2QteHRGY1BHMkh3Q0pvN1Frd29Vc0lMYjJvNGdGbEdfRmpsRm9ocTI0Z09PaGU3UktUTkloeXB4ekhjYkswWEtxWGhEaTB6ZGdqSlE3Q3hablotS3pkU1lQY0xBRVV0a0xfWEQ3R0drREd6MzVPVUdyTm5UUUFVQUtV?oc=5",
      "source_name": "Nintendo Everything",
      "date": "2026-02-12T01:12:26Z"
    },
    {
      "id": "50a623e1-aebd-4da3-b3b0-c47b4a430f19",
      "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users",
      "summary": "Attention, Windows warriors and Office power-users! Microsoft has issued a critical alert: hackers are *actively exploiting* dangerous zero-day vulnerabilities targeting your systems. This isn't a theoretical threat; malicious actors are already leveraging these flaws in the wild. The recent February 2026 Patch Tuesday arrived with crucial fixes, including patches for *six* confirmed actively exploited bugs across various platforms. Your digital defenses are under siege! It's absolutely paramount to update your Windows and Office software immediately. Don't delay; securing your system is your frontline defense against these relentless, real-world cyber-attacks. Protect your data!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOeWlNdWZERjhzWFV3NHI0Z005MWVZRHRPVUdJYmpQQmhYVEY4ak1OaWhwWUE5S1M5dUQ1aXJ3eVFESUdPWEsyTnZmRl9mcWpSTS1YWVkyUHljd0wxOWtrREFlZjlWNmxJX1p4NjlMM1UtT2NvTVhSVEdTOGg2ZzlYdVM3RVA1Y2RpTXNHT0tuVWw0clNKbTRQSjByUlBQam52NUcybFdUck1iT0pGZS1EenhwM2I4djZfSjQ2YlFzdmdsZkpENFpJSGRn?oc=5",
      "source_name": "TechCrunch",
      "date": "2026-02-11T20:46:40Z"
    },
    {
      "id": "072384aa-6707-4143-9c8c-fdcd00f8b663",
      "title": "'Pokémon Pokopia': Oh God, they made 'Minecraft' for Pokémon",
      "summary": "Get ready, trainers! A revolutionary Pokémon experience is on the horizon: Pokémon Pokopia! Imagine 'Minecraft' meets the vibrant world of Pokémon, where you can build, explore, and craft a truly personalized paradise for your beloved companions. Forget battling humans; this is a chill, cozy, and utterly immersive sandbox adventure. Craft intricate homes, design breathtaking landscapes, and watch your Pokémon thrive in a world *you* shape. Early previews are gushing, calling it a potential game-changer that even Poké-skeptics might adore. Whether it's the rumored Switch 2 or current gen, Pokopia promises a fresh, exciting take on the monster-catching phenomenon. This isn't just a game; it's *your* ultimate Pokémon world.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1sWGN1WUNhaWVfb2hKd0dTcVR5amhoSk9rZTZxQWpYVHBQUmVSM1lTcVNHeWFlaUkyZDdTRmFiZHhvTWZ2c245TTBaUzlNcmhQdnROX2RCT3F3eE1iVWdnOTl6eTNIOG1HclRxMGd3?oc=5",
      "source_name": "Mashable",
      "date": "2026-02-12T01:42:36Z"
    },
    {
      "id": "9f0d24f4-4e6f-4627-bdbc-23b7a62c3d3f",
      "title": "Overwatch's new \"story-driven era\" launch doubles release day concurrent record on Steam | News-in-Brief",
      "summary": "Overwatch 2 just unleashed its massive \"story-driven era\" update, and gamers are absolutely buzzing! The highly anticipated content drop, packed with fresh narrative missions and hero challenges, landed on Steam with unprecedented fanfare. This launch wasn't just big; it completely shattered expectations, *doubling* Overwatch 2's previous release day concurrent player record on the platform. It's an undeniable triumph for Blizzard and a clear indicator that the community is fully embracing this exciting new direction. Prepare yourselves, heroes, because the future of Overwatch is looking incredibly bright, promising epic adventures for fans old and new. Jump into the action now!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNZW0wbjRuTXhoN2w1cExPd0ZYTDJfTVhMeFBZVWNHSWY4RG41Z3JVYWVrd1M3VFRxZHE0ckkxWmxMTGJFSGd4S0NZVjdhcy1VVER6R3BpcWp0Uzc2MEw2OGVJYmRLSkhFdHA1M2IzVVV3RWRhWGRSVS1oZ0dGeDYydXo0RnVYQjZzRldXVmY5bWd5Smp1RWNOb1BUaENHbVdPWm5nd2pTSW5oRVVQZ0hMRUR5ZjRldmYzcXNZVHZtLWlhLU9uNnJneg?oc=5",
      "source_name": "GamesIndustry.biz",
      "date": "2026-02-11T19:18:46Z"
    },
    {
      "id": "3a55cadd-4f5b-4e9c-85f5-eb54530b4bd6",
      "title": "Here's when the Samsung Galaxy Z TriFold may be back in stock - GSMArena.com news",
      "summary": "Attention, foldable fanatics! The elusive Samsung Galaxy Z TriFold, a device that pushed smartphone design boundaries, is making its grand return! After selling out incredibly fast, leaving many enthusiasts craving its innovative triple-folding screen, Samsung is set to replenish stock in the US later this month. This highly-anticipated device, known for its groundbreaking form factor and premium experience, proved incredibly popular. Get ready to finally snag this technological marvel and dive into the future of mobile. Mark your calendars for a unique smartphone journey – the TriFold is back!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQc0hqZEl2RWh5bldBdkNuNTk1cUhBaHlDWjQ5VW15WktKLXFUVHZhSEJPY01DLXk5bmlxWm02THlMalRYemw5NFZqWVNLZjVDc283cUNmUHBaVjFlb1R4N05WaVVaUnlXcWNRdVU4OTAyeVZ4MW9jTkM0UVZzcS02ZEdCVXRtLVpJbkV1ZTY5ZTM2bkNXMmZwM2NoUGh1dDBlYUHSAZ4BQVVfeXFMT3c2Skxnb1dUczBrVGxZRHhyaFJEWWRLTGo5RGlJZUlSS09QZEE0bnZjSW1VS2c5ZjFOb2dxTXhKdW52YW5iYnFqcFlZRnJsYjdadzNsOTd3S2hrazRoM1J0UkhCbXd3WjA5Q2V2dWVEZ2E5QkhJQ0dFWUhyRzRRa18wR0JEZnNrOHZwWDBuSnlKNERPUUR2MzhxTmZZbUE?oc=5",
      "source_name": "GSMArena.com",
      "date": "2026-02-11T20:37:02Z"
    },
    {
      "id": "19704599-b5fd-4568-bb16-39cd9f9fffff",
      "title": "Apple releases iOS 26.3 with updates that mainly benefit non-Apple devices",
      "summary": "Apple just dropped iOS 26.3, sending major ripples across the tech landscape! While iPhone users will find familiar refinements and some fresh new features, the real head-turner is how this update *significantly benefits non-Apple devices*. That’s right, Cupertino is surprisingly enhancing interoperability, a massive win for cross-platform users and a potential game-changer for the future of tech. This isn't solely about iPhones; it signals a fascinating and exciting strategic pivot. Keep an eye out for concurrent updates to macOS, iPadOS, and watchOS, delivering a suite of general improvements. Get ready to experience a more open, connected digital world, starting right now!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQc1M5SVZTcEw2dUY1RWFJbXV3alY5c3FHZVNHaW5LRGJlVFdvNEtuSm80anpxOXoyTV9UVmRiUzlsX3otZHFjQlphWDhZTjJSV1JHUmJxOV9ha203cC04YTRCWXR5ak1pOWVDMGI3Q1VRT25lemxKMVlhZlREa0Jqc2g1cVZMM0RvVmpLaDh5NWJTVWNTWkVNblFNM1l4R2xkZE5MaGNWSnkxSm5EOEQ3Mi1nSkVSUQ?oc=5",
      "source_name": "Ars Technica",
      "date": "2026-02-11T19:49:13Z"
    },
    {
      "id": "20db72e5-ec46-4ec0-b97c-7b4bbdcd5000",
      "title": "Get the Excellent Sonos Arc Soundbar with Dolby Atmos for Half the Price of an Arc Ultra",
      "summary": "Audio enthusiasts, prepare for sonic bliss! Sonos is dropping incredible deals on its acclaimed soundbars, perfect for upgrading your home theater setup. The powerful Sonos Arc, featuring immersive Dolby Atmos, is now available at an unprecedented price – often half the cost of its premium Arc Ultra sibling. Imagine cinematic sound filling your living room without breaking the bank! Not just the Arc, the popular Sonos Beam Gen 2 is also hitting record-low prices, making a premium TV audio upgrade more accessible than ever. These limited-time opportunities allow you to experience Sonos's legendary sound quality for less. Elevate your entertainment today!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQZzdVSEJNeVRTdGdJemQ1RDJzeDNGZ01Fb2hUQUNQdUUzQkYzR0RUbXliV2xCOC1MOWlUT2tlM0ZBdHBqdGRlX1E1N2F2NVNHMF9LMzBCLWRGcFBfb0QwOENJNWxyV1FfZk5GXzc0cmxFaF9HUHFqVUZhcEVvWEJRSXBpOXQ?oc=5",
      "source_name": "IGN",
      "date": "2026-02-11T16:45:59Z"
    },
    {
      "id": "43c877bd-418f-44c4-8cbb-3834f839d012",
      "title": "Over 60 Software Vendors Issue Security Fixes Across OS, Cloud, and Network Platforms",
      "summary": "Brace yourselves, tech fans! A massive digital cleanup just dropped, with over 60 software vendors, including Microsoft, unleashing critical security patches across your operating systems, cloud platforms, and networks. This isn't just routine maintenance; it's a full-scale defense operation! Microsoft alone tackled 59 vulnerabilities, but here's the urgent part: six of those were actively exploited zero-days, with hackers already targeting Windows and Office users. This month's Patch Tuesday is a call to action! Update your systems NOW to lock down your digital defenses, protect against these live threats, and keep your tech fortress secure. Don't delay!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNRi1KZmlReTFmcUdTQ0dxY01ackVSS0ZNQVJfQlp4WUppcmpxZ2k4UGVDY2ZZd1dyZ2t2ei1KVkk5cGJLUlNZWWhKYnJCTkJ2UUsyY0dWZnEyUkMtcEZDeGdwMFdOcmtIaDF6NVRGSHQxd25Ea1pLczVYc0FldW5MT0h5UXE?oc=5",
      "source_name": "The Hacker News",
      "date": "2026-02-11T13:28:00Z"
    },
    {
      "id": "57912169-b580-4722-8e76-2007687456d0",
      "title": "Blizzard Is Bringing The Warlock Class To Diablo IV: Lord Of Hatred, Diablo II, And Diablo Immortal",
      "summary": "Get ready, demon slayers! Blizzard is unleashing the highly anticipated Warlock class across the Diablo universe! Prepare to wield dark, forbidden magic in Diablo IV: Lord of Hatred, where the class promises a fresh, insidious way to dominate Sanctuary. Even Diablo II: Resurrected is getting its first massive update in 25 years with \"Reign of the Warlock,\" featuring a new character voiced by the fantastic Rahul Kohli. And for mobile warriors, Diablo Immortal will also embrace the Warlock's formidable powers. This is huge news for fans, promising game-changing spells and thrilling new ways to conquer hellish hordes. The age of shadow magic is here, and it's electrifying!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNUFlSOE1kZTNacXdVVGtSOEIwVDRqYzdWMEw4NDBVdlZzM2ZWWGk5RzVZLUY1ZXltdnpaejBYNUJjQUktREV6dEhRdUFWaUFMbDcydnNlS3JqYm83LTc2NTdudEJLVXZRWi1xVF9RT3BhRHhkU2xJTWM0UDNldi10ZzQwclV0dWZ4dTVYMklkZldYajBXdUFia0xOMGtZUXM4TG8xODByMWYxZFVFVE1rYTFlUmZFdDdTNVRISzYyRno?oc=5",
      "source_name": "Game Informer",
      "date": "2026-02-11T22:59:07Z"
    },
    {
      "id": "3d82616a-7bb2-4cb0-9149-8ed00db4cf86",
      "title": "Apple’s Latest Attempt to Launch the New Siri Runs Into Snags",
      "summary": "Apple's eagerly awaited, AI-powered Siri revamp is hitting major turbulence! Reports reveal the next-gen assistant, designed to be smarter and more capable, is battling frustrating performance issues. Sources indicate the overhauled Siri is proving both slow and inaccurate in testing, throwing a wrench into Apple's ambitious plans. This means the groundbreaking features we've been dreaming of, like advanced on-device AI and deeper app integration, could be significantly delayed yet again. Enthusiasts hoping for a truly intelligent virtual assistant are bracing for a longer wait, with some features potentially pushed to iOS 18.5 or even iOS 19. It seems even tech giant Apple struggles with cutting-edge AI!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNcnlOb2F2dXE4MTdvZ0dUSTVnSmFPeDNQODN6NF9EZkp4WU5QOUxVcmRBNEFPV0E4RWJVLVUtRlZjVndUTnRPS0xQVEVQV09ObXliNjJMQ0sxMUtEdGdKRmhDN0RHRjFtb0ppVXNfUVNtOHVfM290SW9oQVdiQU1HbEVQZmlHWXhMeWYycUpsaVhELUp5X0Y0WEkxdzVON3ZMN0ZjcUNLcTNVTlM2QWQtWWU0emc5TTV1bFdxaEFkVjdDMm42NXc?oc=5",
      "source_name": "Bloomberg",
      "date": "2026-02-11T19:53:28Z"
    },
    {
      "id": "434c47c9-ac45-4271-a157-09c9a4ac8695",
      "title": "Mario Tennis Fever Takes To The Court With A Small Day One Game Update",
      "summary": "Nintendo's latest, Mario Tennis Fever, has officially hit the courts, bringing its signature chaotic fun to players! Enthusiasts are already diving into the action, bolstered by a small day-one game update ensuring a smoother serve right from the start. Reviews are rolling in, praising the game's vibrant energy and unique \"Mario Kart-ification\" of tennis, which injects special moves and power-ups into every match. While some critics note a few minor flaws, the consensus points to an addictively entertaining experience. Get ready for furious rallies, spectacular shots, and plenty of power-ups as this vibrant title aims for an ace!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQV0laTkNlTFZSSkc0VlkzMGMyaERrZjZSRTRVR2VKbEVXeElISEFreUpodkItVUdLZTdPMEgxZDVBLWR1Qnc5a0hVRm1tbHJDcDJuRjZCLU9FWVUzeFhNQkoxa0Znb2czajRwZndSWTMzODdzVWxITm1Ldy1TQXhOR0gyODhoNWpkU3BXM2V3bnI1bS1ZaUM1c1k2SzZHVEZYbmNUM1JCc1Mtb2VDM29xaDVn?oc=5",
      "source_name": "Nintendo Life",
      "date": "2026-02-12T01:30:00Z"
    },
    {
      "id": "535ee3c8-9941-46a2-80e1-80b75947fa70",
      "title": "Rules of mysterious ancient board game decoded by AI, scientists say",
      "summary": "Rules of mysterious ancient board game decoded by AI, scientists say CBS News Rules of mysterious ancient Roman board game decoded by AI Scientific American Ludus Coriovalli: using artificial intelligence-driven simulations to identify rules for an ancient board game Cambridge University Press & Assessment A Roman-Era Stone Baffled Experts. AI May Have Solved The Mystery. ScienceAlert AI simulations reveal a Roman era board game in the Netherlands, pushing Europe’s blocking games back centuries Archaeology News Online Magazine",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOXzVMTU9XSEZ2WXVqRXo5NEFScjA2RFA3TWJybk42VnZodjFMU1FJVXJ4V1hpSVNCdWh1djVwLTNOSjVscWs1eGlXajdROVpPYnhNVFBGaGVIamJVd2VVYWR6NjlFT0pFdWtqU3g5Unp5LVZMcmxrSEJjTFZnUXEtNHlscmxTb3g1ZkRBaG9wR2bSAZYBQVVfeXFMTVc2a0xNQS1UNTJac2diQ3ZwTUVQM3dfQWIyY2FzOFFxSldCYkRiNzB3Y1YzNlo1YVVqY2xKQTF5NEZXMVlfemVtVkZlMW9PYk9wWE03OHY3VEZZXzMzMVZER3U1UWExSU1CR0dhV19scHM5T2hla1Z0aFpKR1oydGdNcS1lREdKdV9oQjJ0Ujh2RndpYTZB?oc=5",
      "source_name": "CBS News",
      "date": "2026-02-11T19:49:21Z"
    },
    {
      "id": "032d5bdf-839a-42a1-a5ed-4f365894da08",
      "title": "Samsung to hold its Galaxy S26 event on February 25",
      "summary": "Samsung is gearing up for its next blockbuster Galaxy Unpacked event on February 25, 2026, set to unleash the highly anticipated Galaxy S26 series! Tech enthusiasts, brace yourselves: this isn't just another incremental update. Rumors are swirling that the S26 will be an \"AI-charged\" powerhouse, promising groundbreaking features that will fundamentally change how we interact with our smartphones. Get ready for a revolutionary leap in mobile intelligence, designed to make your life effortlessly easier and more connected. Expect advanced computational photography, smarter personal assistance, and seamless integration of AI into every facet of the user experience. The future of mobile is almost here!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPZGgtaVNXcmNESnlVNGI1THh3NEpYSE9hdTdFYWVZODd4WVZZUGRPczYxZ2dqNE5BZW1DU1pybnpmMGs3cW9oNzZ3STFiU1VrUF9pekRRWDdmZkRPNUhJTzZZLXhkNk5waWR6LXhQRVBELTEzTkdGWC1VSS1oQUtwZnVHcmhsczEwNW9yelZIUQ?oc=5",
      "source_name": "TechCrunch",
      "date": "2026-02-11T07:06:44Z"
    },
    {
      "id": "8ca326fb-c6d1-4911-b715-4514c06a53b5",
      "title": "Preview: Despite Low Expectations, Pokémon Pokopia Had Me Grinning From Ear To Ear",
      "summary": "Hold onto your Poké Balls, trainers! Pokémon Pokopia is arriving, and it's absolutely smashing expectations. Early previews reveal a game akin to \"Minecraft for Pokémon,\" where trainers can build, craft, and explore with their beloved creatures like never before. Far from a typical entry, this new adventure is described as incredibly \"cozy\" and genuinely charming, prompting grins even from seasoned skeptics. Forget just battling; imagine constructing elaborate homes for your Pokémon, customizing environments, and diving into boundless creativity. This fresh, unexpected take on the franchise promises delightful freedom and a captivating experience that might just convert every Poké-hater into a believer.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPYi12SDlLVjMxY0wtRUZlNThWa0ZkajdjdU9zWlRwMF9DNTd3Z2pZVUItTUVEcGxxX1RxLUFlRlJ4ZUxwOW9ZS3ZNU2xoZlpHc2hRTDNlcVZXaWliZGxicmg0cnNTcjR4M1FudzZ3QXRjVVJsblBIVkcyYWdjNnFTaXNMaTBjT2xiRXhBVkNqY3laRHhLdmJKX040VzFXZ3VFVUU5WGQ3R1J2OGl3Z0lj?oc=5",
      "source_name": "Nintendo Life",
      "date": "2026-02-11T14:00:00Z"
    },
    {
      "id": "f5794e09-f209-442a-bf12-8e7743f15701",
      "title": "Apple Arcade is adding Oceanhorn 3 and three more new games",
      "summary": "Apple Arcade subscribers, prepare for an epic March! The highly anticipated *Oceanhorn 3: Legend of the Shadow Sea* is sailing onto the platform March 5th. This thrilling sequel to the beloved RPG promises stunning adventures and deep lore, picking up where the fan-favorite left off. Prepare to explore vast new worlds and unravel ancient mysteries. But that's not all – Apple Arcade is sweetening the deal with three additional, exciting titles joining the lineup this month. Gear up for fresh challenges and endless entertainment. Whether you're a seasoned RPG veteran or new to mobile gaming, these premium, ad-free additions offer something for every enthusiast. Dive in!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNaUdGRjcxTlZLRUxMLTZCNE9VOFhXcUJ3S0w0VzNxQmRqRUk4TnUtYXdwY1F2M01OUGY0SkR2djhPcjdUNlo3bllCZ2NhVlhpeGJFVUpHTDlGRFV2dE5RYzBoQnYwRG51emZDZ01TOVhsaHZlNWpvYVlDczJlQ3dTS1pBOTkyQXRtTl8wZFpMMDlHRGtWR0E?oc=5",
      "source_name": "9to5Mac",
      "date": "2026-02-10T15:27:00Z"
    },
    {
      "id": "ca47f113-50de-4ed7-94ff-7a86aa481bde",
      "title": "ChatGPT’s deep research tool adds a built-in document viewer so you can read its reports",
      "summary": "ChatGPT's Deep Research just got a killer upgrade for serious knowledge explorers! Say goodbye to tab-hopping: a brand-new, built-in document viewer lets you instantly read its comprehensive reports and source materials directly within the chat. This isn't just convenience; it's total transparency and control. Now, powered by GPT-5.2, you can even hand-pick specific websites for your queries, guaranteeing hyper-focused results. Imagine effortlessly verifying facts, dissecting methodologies, and cross-referencing information without ever leaving your workflow. This is a game-changer, transforming AI-powered research into an incredibly streamlined, powerful experience for every tech enthusiast!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPX09mVjJkTEhtT01nRk5RZ2U2dU5ybWxtOF9HS21lVWtWck9Wa2kwbEQtazZxOHQwbE1vTlZ2SVFyOUVqMENhQUxUYkFjcU5WVWI5aGoydUZBTWJrdVFmYnFnelBPekQwOTZwcFJnSnpMS2IyVkNwd3VWanVKRXBJYVVHTDJwUmNoYUpfOWVFRkoyYm9YX2gtc25HLThUTVFzblRKTklNdVRabEtoaFJ2aVRJOA?oc=5",
      "source_name": "The Verge",
      "date": "2026-02-10T23:02:32Z"
    },
    {
      "id": "df1fa059-38d0-45aa-b9ff-41b5dc5f4462",
      "title": "If You Want To Keep Using Your HomePod, Update It Now",
      "summary": "Attention Apple smart home fanatics! A crucial update is here, and you *cannot* ignore it. Apple is mandating a new architecture for its Home app, effective immediately. Your beloved HomePods, iPhones, and connected smart devices require an urgent software refresh. If you’ve been procrastinating, now’s the time! Failing to update your Home app and associated devices *today* could leave your smart home in the dark. We're talking connectivity issues, features breaking, or even your HomePods becoming unresponsive. This isn't a minor patch; it's a foundational shift. Don't risk your meticulously crafted smart home ecosystem – update everything, everywhere, right now!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNZU91ZnJadjV4MXQyUW9EWTdZb1dOLTFEMmtPTnl1alNsYldVelQxT3M3RFF2RTlXQ3BkeTNDWjlSa1pRdXlfeXVrZlFYSXpoeHZjNjV1cUEtcHNPS3JQWk9yZEJCdEFsdkRQWlZnTWh5SzZ6UVc4T2FUYjRXQk9VS1hydnlGRzVoMUpr?oc=5",
      "source_name": "Gizmodo",
      "date": "2026-02-10T17:53:21Z"
    },
    {
      "id": "04bc7a20-f7f1-4ee1-b553-06dd41b11dbe",
      "title": "Microsoft Patches 59 Vulnerabilities Including Six Actively Exploited Zero-Days",
      "summary": "Heads up, tech enthusiasts! Microsoft dropped a crucial Patch Tuesday update. It tackles a staggering 59 vulnerabilities across their ecosystem, but the headline is the fix for *six* actively exploited zero-day flaws. These are critical weaknesses bad actors were *already* leveraging to compromise systems! Remote code execution and privilege escalation are *seriously* no joke. Updating your Windows and Microsoft software *now* is paramount. Don't delay; secure your digital life immediately. Protect your devices and outsmart those trying to get in!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQOHpjOTZSemZHQnEtVlZUb3JreU1JdjF3cTVMUGhocXI5WE5ESHJmQWpjTVNwblc1OVVUdTRoVGxDWURYYnVQU3hMUDJEYXRYZmYwYTFVS2YxZjNUYjNweGFMTWlBQzlrRmNKUjdwQVBELWhyVjNWVXp1TG9kTThQaw?oc=5",
      "source_name": "The Hacker News",
      "date": "2026-02-11T10:22:00Z"
    },
    {
      "id": "488334e3-93c9-46c4-87c0-92baacf1281d",
      "title": "First Android 17 Beta arrives soon for Pixel phones",
      "summary": "Get ready, Pixel power users! The first Android 17 Beta is rolling out soon, promising an exhilarating glimpse into the future of Google's mobile OS. This isn't just an update; it's a major leap forward, with Google emphasizing continuous developer releases and significant optimizations for larger devices like foldables and tablets. Expect enhanced multitasking, a more fluid UI, and exciting new features designed to supercharge your daily mobile experience. While early access is exclusive to Pixel phones, showcasing the bleeding edge of innovation, remember that not all older devices will make the jump to Android 17. Prepare to dive in and shape the next generation of Android!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNNnYydkloakU2SVRGMmdNajdDX3ItR2ZtUENOM2ZYRURIOVQ0ejJLSEhibHNfZTJHRGJWMHFQSUxCeW9tZHdSNk5fVXdrZEZiTTBOaVBhQnZ0QkZjYy1URXhtN3dEVEFFeDNpTzBPQXFxSDBCLTZsQks4bGZxRlFqWjBkT0hsTGhETGc?oc=5",
      "source_name": "Android Police",
      "date": "2026-02-11T04:18:00Z"
    },
    {
      "id": "2b087d3d-e180-4f15-a238-9e24bf42b311",
      "title": "Review: Reanimal (Switch 2) - Little Nightmares Team Delivers Its Darkest, Boldest Vision Yet",
      "summary": "Get ready, Switch 2 owners! The twisted minds behind *Little Nightmares* are back with *Reanimal*, and it’s an unsettling masterpiece. This isn't just dark; it's their boldest, most disturbing vision yet, promising an experience that will leave you genuinely unnerved. Prepare to face your deepest fears as ordinary creatures transform into nightmarish threats – you’ll never look at a pelican the same way again! Critics laud its macabre brilliance, crafting a chilling atmosphere that grips you from the start. While some minor quibbles exist, *Reanimal* is essential for horror fans seeking a truly unique and visceral adventure. Dare to dive in?",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9UNkFRN0tYSkRNMUpfN0I1RXRLOTg0MTBjTnh1M1Y4RFRmcUVkdXdsTG91eVBvanB2SzRSRnNjeEY3bjlrUElIOUZxSnhpdzR5MDl5Xy1aSC1qQV9mVk84TGV3UGw1S1B1M1pKSW8taUs?oc=5",
      "source_name": "Nintendo Life",
      "date": "2026-02-11T16:00:00Z"
    },
    {
      "id": "0777fb7e-1d1e-4439-8a17-f6ccb615053c",
      "title": "No Man’s Sky update 6.20 “Remnant” out now",
      "summary": "No Man’s Sky enthusiasts, brace yourselves! The epic \"Remnant\" update (6.20) has crash-landed, bringing a game-changing addition to the boundless universe. This massive, FREE content drop finally delivers a highly anticipated feature: the Gravity Gun! After years of incredible updates, players can now wield the power to manipulate objects and foes with incredible physics-based precision. Imagine new combat tactics, environmental puzzles, and creative building opportunities opening up across countless star systems. \"Remnant\" isn't just another patch; it's a fresh layer of immersive gameplay for veteran explorers and an irresistible call for newcomers to embark on their galactic journey. Dive in now!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9xaGJRR1ZZdTQ1OFh6eXBlcjVBWHd4WmdMU3ZoNE1yWmZIM251QzVvcFFGX2d5eVg3SUNMYzlkMFdmdjJyVHhmT3F5SC1GbFl1VHk0ZmZNQ3pQNl95YXI1WlBVb205UThBX05ibmlEYnc?oc=5",
      "source_name": "Niche Gamer",
      "date": "2026-02-11T14:05:00Z"
    },
    {
      "id": "4195b5d1-27c9-41bf-b556-dd22111ac84d",
      "title": "'Romeo Is A Dead Man' Receives Wide Range Of Review Scores, Hits Xbox This Wednesday",
      "summary": "Get ready, gamers! Suda51 and Ren Yamazaki's latest creation, \"Romeo Is A Dead Man,\" is crashing onto Xbox this Wednesday. This hotly anticipated title, fresh from the minds behind Grasshopper Manufacture, is already stirring up a storm with wildly divisive review scores – critics either love its unique blend of controlled chaos or find it a glorious misfire. Expect a signature Suda-style experience, pushing boundaries and challenging expectations. While Xbox players dive into the anarchy, physical editions and even a Nintendo Switch 2 version are reportedly in the works. Prepare for a truly unforgettable, and possibly unhinged, gaming adventure!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPaVUyTW5pb255TGc5SmkzeHlqaTlFVlkyWlZ1WHJCc05SeFNCSERGMFVtNXowV1duR1I5Tm40cU1tclVTUzRFUUZTa1Zjc1plSjM3Q2xfZjhRQ2QtN0VjcVc5ZGFtNW5sbWc4bDdnQWxEVDhFeGs5ZkEzQVV5TURUaWEyUXdVNWJMS2h5V3JZYkZneDd3eUdIdC1DbjBKWWZ4Y2NEQnBiOXNqeWtYMldDZXd5RURDX3lEUGg0?oc=5",
      "source_name": "Pure Xbox",
      "date": "2026-02-10T15:00:00Z"
    }
  ]
}