{
  "news": [
    {
      "id": "65e94d60-7cfc-4207-8e1d-72afd140ece9",
      "title": "Apple's Foldable iPhone Rumored to Feature Unrivaled Battery Life",
      "summary": "Apple's Foldable iPhone Rumored to Feature Unrivaled Battery Life MacRumors Apple is already thinking about its second foldable iPhone, and it may be a clamshell Engadget The foldable iPhone will make sure future Galaxy phones have massive batteries PhoneArena Upcoming iPhone: A \"Flip\" Phone With a Square Foldable Design, Details Leaked The Mac Observer Apple’s Foldable iPhone Plans: What We Know About the Clamshell and Tablet Models WiFi Planet",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQdnV3aG1VQlU1ZjNsNlBOS1BPUjdZTmVlYmpvZDB3QVJRblBkU3FNYjNIZGRmZV9kOGQwUjJtbWoyYzF1SThZWDhvajBmZkpXTlB3RUY1MmZlOVJuWjRDempBMXhPT0FXUkJScExhdDlLU0NlbmpTcFdZS0ZZQ3NaMEJfSDg2MzN0anNIMU9qX0Q?oc=5",
      "source_name": "MacRumors",
      "date": "2026-02-01T17:27:44Z"
    },
    {
      "id": "093c3360-48e2-4b74-8a2e-44b73c64fb03",
      "title": "M5 Pro, Max updates for MacBook Pro expected alongside macOS 26.3",
      "summary": "M5 Pro, Max updates for MacBook Pro expected alongside macOS 26.3 AppleInsider Apple M5 Pro and M5 Max To Launch in March With New SoIC Packaging To Cut Costs TechPowerUp AI is forcing me to buy a new MacBook Pro Macworld Apple To Launch Its M5 Pro And M5 Max Chipsets At The Same Time When It Releases macOS 26.3, Which Is Currently In Beta Testing Wccftech New MacBook Pros Reportedly Launching Alongside macOS 26.3 MacRumors",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPMVBlVXVqQ2xlempDM1h3VkhtWHF4NUVHMUJqQkhHOFFQbThLS0lNSURBM0R1eE96Y0liMUJSY0pTc3dyT3RTcFBGQTVhdUJETmhUTl9ab3VSOEd0enZxem9IdDNyZXV0dlFGTUZKUW1nQ0hUWHFJNzhlalhIVkVJbXZQN0puRmlTY0s2THB1a3ZOVVhVSmtkc0NkSEdUNWV6czNFRjNsWHdtQQ?oc=5",
      "source_name": "AppleInsider",
      "date": "2026-02-01T15:15:54Z"
    },
    {
      "id": "38a98c0b-5382-4a7b-8c22-5883cee085ce",
      "title": "I Tested the New AirTag and Found That Apple More Than Doubled Its Range",
      "summary": "I Tested the New AirTag and Found That Apple More Than Doubled Its Range CNET Why your iPhone wants you to update to iOS 26.2.1 USA Today Apple introduces new AirTag with expanded connectivity range and improved findability Apple iOS 26.2.1—Update Now Warning Issued To Millions Of iPhone Users Forbes AirTag 2 vs AirTag: What's the difference? Tom's Guide",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE9seHg0dEVZQjNVenplN3JTRlpVdmxnQmliNVRfczBhV2JLbVhWUGJDcmFUUVJ1MkFCOEtlcGpUUjFJTkgzaTdZc1ZrTXFnc0hOYXQ3R2R3bzJ0dW9sa2c?oc=5",
      "source_name": "CNET",
      "date": "2026-01-31T15:31:00Z"
    },
    {
      "id": "5f6620f0-66e3-4e7b-978e-a00b82a12cfc",
      "title": "Day Two Highlights at Pro Tour Lorwyn Eclipsed",
      "summary": "Day Two Highlights at Pro Tour Lorwyn Eclipsed MAGIC PLAY Top 8 Players and Decks of Pro Tour Lorwyn Eclipsed MAGIC PLAY Then and Now, Part 1 Magic: The Gathering MTG Lorwyn Eclipsed’s Blight Curse Commander Deck review: a deadly brew ScreenHub Australia Pro Tour Lorwyn Eclipsed Standard Metagame Breakdown MAGIC PLAY",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMid0FVX3lxTE54NldaMC1aaXJ5ZTBXVm5NdWM1Qk9tZ1E5ZzRtYlB3TVhhNVo3NFVwQTN0anROSGlnaDNsY0R5N2p1a3YtQ3lxQ092Y2xxN2lSVE83SmwzWkdhTjBoNHloNlllUzFFMDcxQTNPbWloWG9Gamw4Y1FZ?oc=5",
      "source_name": "MAGIC PLAY",
      "date": "2026-02-01T04:29:49Z"
    },
    {
      "id": "fca42905-2d5d-4421-a8a0-dc5964a2ffef",
      "title": "The Science of the Modern Base Season: Why Zone 2 Isn’t Enough Anymore",
      "summary": "The Science of the Modern Base Season: Why Zone 2 Isn’t Enough Anymore Outside Magazine",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNbjd1b0IxUzBHTXRtWV83QTd2RmViQXE3Y19iZlZOODdTeWp4amNtT1NIYmUzaDAwSUlNLWdkMXh5amxWMjI3bVF4MjRuU2JJYXNVenp6VEx6ZER1ekZiS1MtNkVQWVRaRXROd0dZWDJEeEVhdENhMG1BNGtWcWhIOXB6Si1IZmhyRHhsc0lHREFKWENhYVRqU3o5bFhhM0ZuSmdDendpQWZDa0RrN0FaS0h2dWtpblpnOG1v?oc=5",
      "source_name": "Outside Magazine",
      "date": "2026-02-01T17:10:28Z"
    },
    {
      "id": "999d22f0-c9d3-48d4-af29-5ca9c6edcadb",
      "title": "Pokémon GO Events This Week: February 2 to February 8, 2026",
      "summary": "Pokémon GO Events This Week: February 2 to February 8, 2026 Pokémon GO Hub Pokémon GO February 2026 Community Day Features Vulpix and Alolan Vulpix Pokemon.com Pokémon GO February 2026 Community Day Guide Nintendo Wire Pokémon Go Vulpix Community Day Eurogamer Pokemon Go January 2026 Events: Raid Bosses, Spotlight Hours, Community Day, And More GameSpot",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQeWxsSy1hUzhGcW9NZUJqYlBNX3lVckprdHV3UU8yVElXc2NySnp5d0dOejRVQ3k3dVVreVItTG1hcDZKeDk0cUZNVlQ5clR3RGZGblcxek1BNGNROG5IS1dlQ3JQNTBIMGQ4LVRibTVSVmF6SG1FVlgwbng1UVAtd3ZJZ00zSWlULVhaZzB2UWxXN0R5dlFJZHp3?oc=5",
      "source_name": "Pokémon GO Hub",
      "date": "2026-02-01T17:39:02Z"
    },
    {
      "id": "13fecafd-2b5b-4d00-930f-60780411b1e5",
      "title": "Escape from Tarkov ducks for its first major crossover event",
      "summary": "Escape from Tarkov ducks for its first major crossover event Eurogamer Steam hit Escape From Duckov gets official crossover with Escape From Tarkov, bringing the two extraction shooter giants together GamesRadar+ Nvidia’s Next Bottleneck: HBM4 Memory Ramps as China Access for H200 Stays Uncertain FilmoGaz Escape from Tarkov Crossover Teased with New Promo Code Insider Gaming A new Escape From Tarkov collab with the 'rival' that stole its Steam launch thunder adds one of Arc Raiders' best bits PCGamesN",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQUGpjb1NaNFlPc3AxUDBTR1diLUtIbl96Uk81eTVuQnFzaGdlWUdFUl84bWdyMHByMFZPZEhJT19ENlRWcERPaDl6cThZRnBVOGZYNjJLdFFqU1RVSlBnTU56RkFsdXpmVHBMekpBa2FSQkg4RE5VejlEamk1dm9qT2Nsdm56Z2pEQjluakZkUQ?oc=5",
      "source_name": "Eurogamer",
      "date": "2026-02-01T17:56:24Z"
    },
    {
      "id": "446cf3b9-9b96-496a-949a-5a6754f8dd05",
      "title": "What to expect from Samsung Unpacked 2026: 5 biggest rumors on Galaxy S26 Ultra, Buds 4 Pro, more",
      "summary": "What to expect from Samsung Unpacked 2026: 5 biggest rumors on Galaxy S26 Ultra, Buds 4 Pro, more ZDNET Samsung Galaxy S26 Ultra Release Date: New Leaks, Disappointing News Forbes Samsung Galaxy Unpacked 2026: The Galaxy S26 lineup and everything else we expect Engadget Exclusive: First look at Samsung’s 25W wireless charger, possibly for Galaxy S26 SamMobile Samsung Galaxy S26 Ultra: The ‘No More Excuses’ Flagship Geeky Gadgets",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQMVRHbGp3Mld1RDVnemFWeUlPdzd3b2VicW9jTkgwek94UDI0X19Mb0J2bXdQTmhENTlpekxUR3ZTSEFCVjJrZmYzZ0tYVllVdWFkSUNTLVBZLVBsaHlpRFVEdGYwOEYxOG4ycFhSOXRfUWh6Y1FXNG9uZm51ZGVMYk5Rb0tDWThpZ3FxQw?oc=5",
      "source_name": "ZDNET",
      "date": "2026-02-01T11:00:00Z"
    },
    {
      "id": "ac82416b-7649-40ca-95b3-ad0a0c3168a4",
      "title": "Wait, Google Project Genie can generate playable Mario and Zelda games?",
      "summary": "Wait, Google Project Genie can generate playable Mario and Zelda games? Creative Bloq Genie 3 Google DeepMind Project Genie: Experimenting with infinite, interactive worlds blog.google Videogame stocks slide on Google's AI model that turns prompts into playable worlds Reuters Google’s AI helped me make bad Nintendo knockoffs The Verge",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOSnVfMmR4QV9ZaXZ3ZWRTcEpNUmN5VEdiLTR5MWowRW5LdmREcmp4azdZeXBrY01mRkRqT19SbXZJMjRhUkFtbUxEYjNaM2FJZEhKZ2pFZTN4bzVWT0RCMW5vcUoxTlk4aldQV2dXMmpjcWE4R21vV0VYZEt0ckFVQTFCZDBueUFNdEhZUDdJLWFlZmlKQVFndU43NGY0b3hkV25qMWRJZnFZTmJrUldsWGZSX1dqM3poVTlTeWM1LVc5MGJsVkE?oc=5",
      "source_name": "Creative Bloq",
      "date": "2026-02-01T08:00:00Z"
    },
    {
      "id": "5f2ec193-0780-468a-8d51-46a687c167b2",
      "title": "This to-do app actually keeps up with my brain",
      "summary": "This to-do app actually keeps up with my brain Android Police",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNQVY1aXVrQ1JxRUYxTjhEMzViQ3pfdE9WNUFLU1ZpeHJmODNGRFh4VjIzNnZJZ000SnNUeVNYeEVBV0dEV2Zud1NOMHctNjcwM0k1T01SZXFQQ1J2T3dXcmUtZnlVOHJJZVhOVVk5QzRWWHAydHJER0ZoRVM1QV8yR3BTMA?oc=5",
      "source_name": "Android Police",
      "date": "2026-02-01T17:15:10Z"
    },
    {
      "id": "db6e3b3c-30b1-4402-8069-f41b1e7e83c7",
      "title": "The Reason Why OLED TVs Are So Expensive",
      "summary": "Ever wondered why those gorgeous OLED TVs carry such a premium price tag? It boils down to groundbreaking tech and intricate manufacturing! Unlike traditional LCDs, each OLED pixel is self-emissive, generating its own light for unparalleled blacks and vibrant colors. Achieving this pixel-perfect brilliance isn't cheap. The production process for these organic light-emitting diodes is incredibly complex and delicate, especially for large panels. This leads to lower manufacturing yields and specialized factories, primarily from a few key players. Essentially, you're investing in cutting-edge innovation and the painstaking precision required to deliver that breathtaking visual experience. It’s the ultimate cost of unparalleled visual perfection right into your living room!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMibkFVX3lxTFBzdFdVMll3c3Uxek9FUFFNV3k0R0VJQ1hLWG13VWEwa1VDUktCU0xSckxSdmt1QlU0Zl9fQS1sLVh3bzItVFRocVMycldwX0FMNEdoOHY3eVJHcndsdmNJOXdEbzNBTE16a2xfNm93?oc=5",
      "source_name": "bgr.com",
      "date": "2026-02-01T02:17:00Z"
    },
    {
      "id": "3426d0f5-99fd-49eb-b299-4a460d112701",
      "title": "Apple's first foldable will sport the largest battery in iPhone history",
      "summary": "Hold onto your hats, tech enthusiasts! Apple is reportedly gearing up to unleash its first-ever foldable iPhone, and it’s packing a monumental secret weapon: the *largest battery in iPhone history*! This isn't just about a new form factor; it promises unrivaled, all-day power that could redefine endurance for premium smartphones. Imagine a sleek, foldable device that never leaves you scrambling for a charger. This game-changing move from Cupertino is poised to force competitors, like Samsung, to significantly upgrade their own foldable battery tech. Get ready for a monumental leap in mobile innovation and power management! The future looks bright indeed.",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPY0tCRHlUMVF5RmFlNkdFczM0UDBkckwzNXREVkY2SjZBQk5INHFIYzZVZ2NOMm94MEpmUEhaeUpxRm12enVhTnlJM1AtaklyQWJ3VTFTRXBNWjNSR3ZsSHJKRGNhVWlNaDlLeTVaYUh5UTlyTzNENTFrNXNja2ljaXpYNExhMDZhTTEtRldCSVRpZw?oc=5",
      "source_name": "PhoneArena",
      "date": "2026-01-31T11:17:05Z"
    },
    {
      "id": "6f0fb989-581a-4631-bdb8-dc46d8669b23",
      "title": "Top 8 Players and Decks of Pro Tour Lorwyn Eclipsed",
      "summary": "Get ready, Planeswalkers! Pro Tour Lorwyn Eclipsed delivered an electrifying showdown, where strategic genius met cutting-edge deck construction. This deep dive into the Top 8 reveals the titans who conquered the metagame. We're talking about the innovative archetypes that crushed the competition, from lightning-fast aggro to mind-bending control, showcasing the absolute pinnacle of Magic: The Gathering gameplay. Discover which players mastered the intricate Lorwyn block mechanics, wielded powerful blue cards, and built the budget sleepers that unexpectedly dominated. Unpack the metagame breakdown and learn from the pros who navigated the complex Standard format to achieve glory. This is essential reading for aspiring champions!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBsalY2Z1k0bmhvR1lxbkFKNVZFdEpQaGtwdUxFY1Jja0hlR010VkJydWdaZVZxYmZCV2FSaGJ4RkNZN294TTJEdFNhNC16SHN1dDZaSVFtd1JPOUNidk5mdEswQTJJNGU3THVGTWotVmEzbzM1c2FYT0JrQTJzUQ?oc=5",
      "source_name": "MAGIC PLAY",
      "date": "2026-02-01T05:59:49Z"
    },
    {
      "id": "d381e475-fa86-420a-a552-57e02b2702da",
      "title": "Is it really possible to 'bank' sleep for later?",
      "summary": "Ever wished you could \"bank\" sleep for those all-night coding sessions or epic gaming marathons? The dream of stashing extra rest for later, like a digital deposit, is incredibly tempting! But does the science stack up? Experts reveal you *can* build a small \"sleep buffer,\" a protective shield against *mild* deprivation. Think of it as pre-loading your system. This isn't a free pass for extreme sleep debt, however. While a few extra hours beforehand might slightly blunt the edge of a late night, it won't entirely negate the fundamental need for regular, restorative sleep. It’s more about damage control than a magic bullet for peak performance. So, optimize wisely!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPeFJOaDFKTlptM3hvRmFsRXBWXzZvUTE3SnRLeVRoZE4xVll5VHI2aDVtYWNwWHJCb0p1S2xLdklJdDUyNUF1RnNXV1NnanhLU2VkWHBSLWJYMS1Ec18xLU1LbGFzUktmdTR0cVJ3bDVFcWFpd0FkV0lSWmEweGkzOWs2Zm42RFJtQm9fb0FBdmpSVmM?oc=5",
      "source_name": "BBC",
      "date": "2026-02-01T10:00:00Z"
    },
    {
      "id": "c8c673b6-de00-46c9-9121-e21a62b5909c",
      "title": "Cloud storage payment scam floods inboxes with fake renewals",
      "summary": "Heads up, tech warriors! A nasty new scam is swamping inboxes, posing as urgent cloud storage renewal notices. Cybercriminals are deploying sophisticated phishing emails, complete with convincing logos and payment demands, tricking users into believing their subscriptions are expiring. These fake alerts pressure you to \"renew now\" by clicking malicious links that funnel your sensitive credit card and personal information straight into their hands. Don't fall for it! Always scrutinize the sender's email address and navigate directly to your cloud provider's official website to manage subscriptions. This widespread attack targets major services, so stay vigilant and protect your valuable data from these digital fraudsters. Keep your cybersecurity shields up!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNRGh5OEEzUWtQRnBXbE92Ry1NX2hFclRuN0Q5M1JncDJGaUNlRjI5d3RZekRtR2YwV2d5bHlLNGdER3NqcU1vbGRNM0xtQ2g5NjBKWGl0cGx0dVBhZjVUdkdGR3kzaHQtREV3UFVFNlFmTWxRQW5fTDFUYnY0bFphdjNyUllJa0RLRW9qQVNyUVZBbDVVVEFBM1M0VmJCbFl0TDRtWHRLREFybnJT0gGyAUFVX3lxTE1aS3ExNmJYQjQ3ZFRWWmQ1czFQZmw2a3B3RUF4cEJjcEMxb3YxZjk4VWhGTmJmSlFDUTh0VGtkVEpnREpfaXNCbGZqQmJlNTVhYUdMd1E1MnU0c3FJMmpGNjlTN2RhcHhIXzdMUTVhclNoMXBoQ0NGQVMza2l6cWU4MkpFR2lWc0JlbnBOSXljV2R1WEpjc0hTMW83WjQzWENmTFpsalRUMEJaODI0ZVJPVFE?oc=5",
      "source_name": "BleepingComputer",
      "date": "2026-01-31T16:21:32Z"
    },
    {
      "id": "1ae3f141-7991-4275-89bf-f28f1e60761a",
      "title": "These Are The Best Car Tires Of 2026, According To Consumer Reports",
      "summary": "Future drivers, get ready! Consumer Reports just dropped their bombshell list for the Best Car Tires of 2026, and it’s a game-changer. Forget yesterday's rubber; these cutting-edge performers promise revolutionary grip, extended longevity, and unparalleled safety features. Enthusiasts will drool over innovations like adaptive tread compounds that optimize for varying conditions, giving you ultimate control whether you're carving canyons or navigating downpours. Expect whisper-quiet rides, improved fuel efficiency, and materials designed for peak environmental sustainability. CR’s rigorous testing means these aren't just hype; they're the real deal for next-gen vehicles. Get ready to elevate your driving experience with this ultimate tire tech revolution!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMiekFVX3lxTFB1UEVTREp2am5rVGM3SjcxbzBxaDlXU1NNUVEwSHlTOHdveUVkdTBEbGxMOW5PUlBhdll6XzllN2F2d2o4SkxhYkZ4NkpuVkl1dVFCSEUwSDA1Q3FHM2lsRWgybmRKdVM5aHhrR3hVTWhoV1dCQktSWnp3?oc=5",
      "source_name": "Jalopnik",
      "date": "2026-02-01T13:45:00Z"
    },
    {
      "id": "98e48fce-87b2-4cb9-a3cd-d9eae4a470bd",
      "title": "The video games industry is killing itself and no one seems to care - Reader's Feature",
      "summary": "Hold up, gamers! Is the industry we love secretly on a path to self-destruction? Recent reports paint a grim picture, suggesting the video game world is actively sabotaging itself, and worryingly, an alarming apathy has set in from all sides. From predatory monetization to repetitive releases and a perceived disconnect from its most passionate fans, the very foundations of what makes gaming special seem to be eroding. Some even point fingers at us, the players, for enabling problematic trends. This isn't just a blip; it's a systemic issue that risks alienating the \"superfans\" and diminishing the magic. Can we reverse this worrying trend before it’s too late?",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOUWJOZGhlVGVOejEyV3FURXkxaTY2SEpJcHlqNXU3SmhPZjN3RHRLenhQTFlaWk52SHFaaVhXQWd5UEpYRjdxX3o1MDNyOFl1aUlTUlo5NEZUR2NUOWdZZ0VDdVVtd1A0NlhGeUo1MXZzYWZlM3VTOWhGUGxxZ256Z1o1dG5uMERKUTN2UFFVcl9QckltblZSUzY3X2l2YUVpSUZUc3RB?oc=5",
      "source_name": "Metro.co.uk",
      "date": "2026-01-31T01:00:00Z"
    },
    {
      "id": "1b59f8be-3993-4180-b65f-bd0da524f6dd",
      "title": "Pokémon GO February 2026 Events",
      "summary": "Get ready, trainers! February 2026 in Pokémon GO is set to ignite your adventures with an action-packed schedule! The spotlight shines brightest on Community Day, featuring the adorable Vulpix and its stunning Alolan form. Prepare for an epic day of catching these fiery foxes, boosting your chances of finding shiny variants, and evolving them to learn exclusive powerful moves. Beyond Community Day, expect a slew of exciting raids, research tasks, and other mysterious events to keep you glued to your screens and exploring the real world. Don't miss out on the chance to power up your team and fill your Pokédex! Get ready to GO!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMid0FVX3lxTFAxRjZrbHhTSy0zSS05VjFYaFlFYjVaOXRNTTJxd3NES001OHRXT2RoVmRxbFBWOGNBRXlxS3lDeE9NOXR2U3FrTHVCWUVIT3FVOWFIZXJfd1lfOVZaMXJBLVdZTUVlSjZpYkJzQkdNRTQ1V2R6eXJB?oc=5",
      "source_name": "Pokémon GO Hub",
      "date": "2026-02-01T07:17:55Z"
    },
    {
      "id": "985e6443-799e-4766-97e5-7fe3bb6c7f5c",
      "title": "12 Cool New Gadgets to Keep on Your Radar",
      "summary": "Get ready, gearheads! A fresh wave of innovation is hitting the market, and we've got the lowdown on 12 must-see gadgets that demand your full attention. From game-changing smart home upgrades that redefine convenience to cutting-edge audio tech delivering unparalleled soundscapes, this roundup has something for every tech enthusiast. Imagine futuristic wearables simplifying your life or ingenious tools boosting your productivity to new heights. Each pick promises to elevate your digital experience, offering sleek designs, powerful performance, and features you didn't know you needed. Dive in and discover your next obsession – these aren't just gadgets, they're glimpses into tomorrow!",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE4xUmUxYU0tM25tQUZHbnl0N2oyckh3cVZURUpvM1J4RUg4Tngwa0g0U1RJeS0wYmFYZkhJWjlpX3dsVlJpdVBwWjFhczI5b2p0RmV5M1Z0MndqM01mdkZHTVZKUFQxdS1hZHdYR3JHMzJjX2gw?oc=5",
      "source_name": "Gear Patrol",
      "date": "2026-02-01T13:00:00Z"
    },
    {
      "id": "9edf1ac4-1b47-456c-aefb-ca1133655f37",
      "title": "Samsung Galaxy S26 Ultra: First official promotional poster leaked",
      "summary": "Samsung Galaxy S26 Ultra: First official promotional poster leaked Notebookcheck New Samsung Galaxy S26 Ultra Leak Confirms Disappointing News Forbes Samsung Galaxy Unpacked 2026: The Galaxy S26 lineup and everything else we expect Engadget More details about Galaxy S26’s camera and colors emerge SamMobile Samsung Galaxy S26 Ultra: The ‘No More Excuses’ Flagship Geeky Gadgets",
      "image_url": null,
      "source_link": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQQlozZmRGaTBiUTJPRWM3ZXlITU1uS2V1UXY2N0Z0VjVXRlhOU2hzbjNNdkEtLU94ZUpyN1pRZmJ0M1pBdUwzckRMTmRjc01FbVpMUUVVMkY2dUhHd0ctcWMtX1E3R2E0Slc3WXRDcmM4UGh2TGdWSm5mQXFoaURMZl8zU1ptdHZzM1FfYkpOOTVMajhQWTBoVjZRZEdNOEZwSXd0aEQzZXFSdTduYXM0?oc=5",
      "source_name": "Notebookcheck",
      "date": "2026-02-01T10:26:00Z"
    }
  ]
}